{
  "departments": [
    {
      "department": "English",
      "courses": [
        {
          "title": "English I",
          "description": "English I develops a student's ability to read perceptively and to write accurately and effectively. Organized around the study of global literature, this course allows students to study short stories, memoirs, novels, dramas, and poetry. Writing progresses from the construction of single paragraphs to multi-paragraph compositions, developing students' skills in crafting both interpretive essays and personal narratives and leading to their final writing project, which develops and combines both styles of writing into a single, coherent essay. Throughout the year, the course emphasizes vocabulary, grammar, and punctuation. Representative readings include Sophocles' Antigone, Marjane Satrapi's Persepolis, poetry, short stories, and classic and contemporary fiction.",
          "department": "English",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "term": "year course",
          "offered_in_25-26": true,
          "required": true,
          "grades": [
            9
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "English II",
          "description": "The literature studied in this course covers a wide range while focusing on a core of British literature and colonial and post-colonial works. The writing instruction emphasizes close reading, encouraging students to work toward establishing and developing a clear, carefully focused thesis and toward achieving greater maturity in style. This course reviews the skills taught in English I and continues the emphasis on vocabulary, grammar, and punctuation. With a focus on analytical writing, students begin the year working on single-paragraph structures building to a major five-paragraph analytical essay written in the spring term. Representative readings include Shakespeare's Othello, Chinua Achebe's Things Fall Apart, poetry, and short stories.",
          "department": "English",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "term": "year course",
          "offered_in_25-26": true,
          "required": true,
          "grades": [
            10
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Writing Workshop",
          "description": "As part of their work in English, sophomores take Writing Workshop, which meets once a cycle through the year. The workshop program includes targeted and focused instruction on the writing process and a systematic review of formal structures of language.",
          "department": "English",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "term": "year course",
          "offered_in_25-26": true,
          "required": true,
          "grades": [
            10
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "English III",
          "description": "As they read more complex texts, juniors review, develop, and extend the skills taught in the first two years. The fall term begins with a focus on rhetoric and argumentation, and the winter and spring terms lead to more advanced literary analysis. Students work on close reading and sustained analysis, considering a variety of literary techniques and themes. Writing assignments include both literary analysis and personal essays. This class centers on American literature. Representative readings include Fitzgerald's The Great Gatsby, Baldwin's Giovanni's Room, poetry, short stories, and essays.",
          "department": "English",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "term": "year course",
          "offered_in_25-26": true,
          "required": true,
          "grades": [
            11
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "CL English III Seminar",
          "description": "This course requires students to read major works of literature and to develop their skills for writing both analytical and personal essays. Benefiting students whose greater experience with language and literature allows them to succeed with more challenging reading and writing assignments, this course assumes significant student participation in class discussion. Like English III, this course centers on American literature. Readings could include those listed for English III and additional works selected by the instructors.",
          "department": "English",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "term": "year course",
          "offered_in_25-26": true,
          "required": true,
          "grades": [
            11
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "English IV: Banned Books",
          "description": "Books have been banned, burned, seized, and sanitized throughout history. Even today, school administrators, religious leaders, authoritarian regimes, and democracies continue to censor texts that pose a threat to their values. With societies around the world opening new conversations on free speech and political correctness, this course aims to consider when, if ever, censorship is justified. In doing so, we will discuss how banned books reflect the cultures in which they are written. Readings will include texts banned on political grounds (e.g., Fahrenheit 451, Wild Swans), on religious grounds (e.g., Slaughterhouse-Five, The Satanic Verses), on moral grounds (e.g., \"The Wife of Bath's Tale,\" The Handmaid's Tale, The Bluest Eye), and for other controversial content (e.g., The Adventures of Huckleberry Finn, Drown).",
          "department": "English",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "English IV: Ghosts and Monsters",
          "description": "Parul Sehgal characterizes ghost stories as \"social critiques camouflaged with cobwebs\" and \"vessel[s] for collective terror and guilt, for the unspeakable\" in his 2018 New York Times article, \"The Ghost Story Persists in American Literature. Why?\" Ghost stories have been around for as long as people have been; they have long served as the vehicles through which societies and individuals express their fears, traumas, and things best swept under the rug. If history is written by winners, then ghost stories are written by losers — or, those disenfranchised seeking to reclaim their voice. Spanning all forms and all cultures, the ghost story is a universally employed medium to commune with things that most would prefer stay under the bed. In this course, students will learn not only about the many ghosts of our society and how they take form, but also of art as a form of activism and a memorial of past injustices. The course will emphasize ideas of the importance of truth-telling and the power of old wives' tales, fairy tales, or the stories told by those we all too often dismiss as crazy. Representative texts might include Ahmed Saadawi's Frankenstein in Baghdad, Carmen Maria Machado's Her Body and Other Parties, Charlotte Brontë's Jane Eyre, and others.",
          "department": "English",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "English IV: Graphic Novel",
          "description": "Since the ground-breaking publication of Art Spiegelman's Maus in 1993, graphic novels have entered the global cultural and academic mainstream, inspiring complex interdisciplinary and multicultural analyses. In this course students will survey the current field and read works of fiction (Watchmen, Asterios Polyp, The Arrival), autobiography (Maus, Persepolis, Fun Home), and journalism (Safe Area Gorazade). In order to understand these works and the cultures that produced them, students will write essays using interpretive lenses focusing on history, gender, psychology, and class. Students will also explore the relationship between text and image in analyses as well as develop short sequential art sequences of their own.",
          "department": "English",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "English IV: Migrant Stories",
          "description": "Humans migrating to new places, new countries, and new continents is a story as old as time—not just something for the current news cycle. In this course, we will read the stories of individuals and groups who have journeyed to new places—often out of a desire for a better life but just as often because of involuntary displacement or the need to escape horrific circumstances. Of course, with this change of region, country, or continent comes not only some form of severance from the old place and the old culture but the need to cope with the strangeness of a new country and culture. Consequently, many of the questions we will ask of these texts will concern personal identity—how much is it tied to place? Does a new country or place mean a new identity? What does it mean to reconstruct one's life in a new place? Migration is not a narrow or isolated experience—there's a broad range of groups who have experienced and written about this experience—from Irish immigrants fleeing the 1840s Irish famine to the Great Migration in the early-to-mid-20th century to modern migrants fleeing poverty and political strife in Central and South America, Africa, Asia, and Europe. Potential texts might include Wilson's Joe Turner's Come and Gone, Adichie's Americanah, Cisneros' House on Mango Street, Nayeri's The Ungrateful Refugee: What Immigrants Never Tell You or The Penguin Book of Migration Literature.",
          "department": "English",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "English IV: Race, Roles, and Religion",
          "description": "In our increasingly interconnected world, literature can provide insight into the broadest palate of human experiences. Exploring the fiction, poetry, essays, and drama of writers beyond the traditional Western canon, this senior elective will examine boundaries: race, age, ethnicity, gender, nation, physical ability, sexuality, religion. Topics will focus on questions of culture and identity from global and literary perspectives. Students will read and respond to a rich diversity in experience and traditions. Authors will vary according to the term and may include the works of Chinua Achebe, Aravind Adiga, Sherman Alexie, James Baldwin, Kate Chopin, Countee Cullen, Edwidge Danticat, Jonathan Safran Foer, Rebecca Gilman, Langston Hughes, Jhumpa Lahiri, Nella Larsen, Jonathan Lethem, Toni Morrison, Alice Munro, Téa Obreht, Maggie O'Farrell, Grace Paley, Ann Patchett, Amy Tan, Gene Toomer, Alice Walker, Wendy Wasserstein, Virginia Woolf, and Richard Wright.",
          "department": "English",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "English IV: Satire",
          "description": "As a literary genre, satire has been around as long as writers have had the audacity to address the foibles of humanity. Juvenal, the Roman satirist, once said, \"It's hard not to write satire,\" suggesting that targets abound for those willing to poke fun at their fellow human beings and their many institutions. Through exploration of satirical novels and pop culture publications alike, this course explores how writers use wit and irony to challenge norms, expose hypocrisy, and spark conversation. Along the way, students examine both how and why satire works, considering in the process the role of humor, hyperbole, mockery, understatement, and other tools of the trade. Representative texts may include the works of authors such as Jonathan Swift, Kurt Vonnegut, Jane Austen, Paul Beatty, and Nana Kwame Adjei-Brenyah.",
          "department": "English",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "English IV: Stories of War",
          "description": "One of the unfortunate realities of human history is our species' tendency toward conflict. This course will eschew the historical and political causes of war in an attempt to understand the mythological, symbolic, literary, and psychological perspectives of the individual soldier. Sub-themes might include the transformative power of combat and violence, the brotherhood forged between fellow soldiers, the social ramifications on the homefront, or the cultural shifts in societies embroiled in war. Readings will focus on fictionalized accounts of wartime experience in combination with literary non-fiction produced by combat veterans and journalists. Students will be expected to grapple with the conflicting ideals of duty, honor, patriotism, exhilaration, fear, shame, regret, confusion, and betrayal. Potential texts include works by Ernest Hemingway, Sebastian Junger, Kristen Hannah, Uzodinma Iweala, and others.",
          "department": "English",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "CL Senior Writing Seminar: Guided Humanities Research",
          "description": "This course provides students with opportunities to develop and refine college-level skills for inquiry, research, analytical thinking, and writing as they complete a research project in the humanities. Students will engage in sustained, significant, mentored research that draws on previous academic courses, such as United States History, experiences gained from work in their communities, or through the Norton Family Center for the Common Good and the Alvord Center for Global & Environmental Studies. Possible topics may include: race and democracy in South Africa; sociology and politics of mass incarceration; history of the American college; food deserts in the United States; and gender in contemporary African American fiction. Along with intensive independent research and writing, students will participate in frequent collaborative activities such as peer review, discussion, and group projects.",
          "rigor": 2,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL English IV: Contemporary Literature",
          "description": "This course offers a study of a variety of contemporary novels, short stories, plays, poems, essays, and articles. The course focuses on understanding the values and attitudes expressed by contemporary writers, including those who write about social issues and cultural development. In recent sections of the course, students have explored works by writers including Ocean Vuong, Jesmyn Ward, Colson Whitehead, Rebecca Makkai, as well as a range of other contemporary poets, fiction writers, and essayists.",
          "department": "English",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL English IV: Creative Writing",
          "description": "This course gives students the opportunity to study the techniques and styles of professional writers; to study the work of other students; and to practice writing in a variety of styles and genres. Throughout the term, students will examine the work of master storytellers to glean the secrets of the trade and gain a better understanding of the elements of the craft, including characterization, diction, plot structure, dialogue, point of view, and voice.",
          "department": "English",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL English IV: Literary Adaptation and Reinvention",
          "description": "Great stories are rarely told just once—they're retold, reimagined, and transformed across different cultures, times, and mediums. This course explores the art of literary adaptation, examining how stories are transformed across a range of forms, from novels, short stories, poems, and plays to their retellings in other literary genres, performance arts, film, or other visual arts. Through comparative study, we'll ask critical questions such as: What changes when a story transitions between different forms, and what does that reveal about the storytelling tools of those different creative forms? How do creators—be they writers, directors, or other artists—reinterpret texts for new audiences? What roles do historical, cultural, and artistic contexts play in shaping these adaptations? With a focus on analyzing both original texts and their diverse adaptations, students will consider not only how meaning is constructed differently across mediums but also how adaptations can illuminate or obscure aspects of race, gender, class, and culture.",
          "department": "English",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL English IV: Literature and the Environment",
          "description": "How does place shape identity? Is the natural world a physical resource to be exploited or conserved, a challenge to be conquered, or a sacred space to be preserved and revered? Exploring the connections between literary texts and the history of environmental thought, this course will focus on the cultural, metaphorical, and symbolic values of the non-human world, while also investigating its ecological significance. From wilderness to the worked landscape, from suburban to urban environments, students will examine the ways that the language of literature, film, and popular media construct our awareness and appreciation of the non-human world. Potential texts include works by Henry David Thoreau, Leslie Marmon Silko, Wendell Berry, Octavia Butler, and others. In addition to analytical writing, students will write creatively about their own experiences in and with the natural world.",
          "department": "English",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL English IV: Magical Realism",
          "description": "Magical realism is a form of literature that collapses the boundary between the fantastical and the ordinary, forcing the reader to see \"reality\" through new eyes. Closely associated with 20th-century Latin American authors such as Gabriel García Márquez and Jorge Luis Borges, magical realism has attained a truly global reach, as writers and artists from around the world have employed it to reflect and refract deeper understandings of society. This course will explore magical realism in its Latin American context and across cultures, in prose, poetry, and film. Beginning with the works of Márquez and Borges, the course will attempt to isolate a set of characteristics that define magical realism. From there, students will explore how other authors have experimented with magical realism around the world and compare how those artists have utilized magical realism in their own ways. From the works of Lin Manuel Miranda to Kazuo Ishiguro and Jesmyn Ward, the class will see how the threads of magical realism can connect Latin America and the wider world and how place and genre can open a broader understanding of the ways artists manipulate reality to develop meaning.",
          "department": "English",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL English IV: Shakespeare",
          "description": "Shakespeare is widely recognized as among the greatest—and certainly most influential—writers in the history of the English language. What makes his works endure? This course gives students the opportunity to explore this question for themselves, offering a deep dive into selected plays and sonnets. Students will consider how these texts were staged and received in their original Elizabethan and Jacobean contexts as well how they continue to be reinterpreted for modern audiences. Through close textual analysis and discussion of theatrical conventions across centuries, students will uncover the richness of Shakespeare's language and probe its dramatic potential. Selected texts will reflect a range of genres, and may include plays such as Henry IV, Henry V, Much Ado About Nothing, King Lear, The Tempest, and The Merchant of Venice.",
          "department": "English",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL English IV: The Harlem Renaissance",
          "description": "This CL senior elective is designed to give students their first entry into a focused study of one of the most important periods of American literature, art, and culture. Spanning a period from roughly the mid-1910s through the mid-1930s, the Harlem Renaissance was a time when mass migration to Northern cities brought together numerous African-American writers, artists, scholars, and musicians in the Harlem neighborhood of New York City. This course will focus on some of the prominent writers of the movement in an attempt to uncover the stylistic tendencies of their work and the impact those writings had, both on other writers of the period and on the larger culture as a whole. Students will also experience a selection of art, music, and essay as they develop strategies for understanding what bound these artists together into a generally accepted \"movement\" and for determining how their work still influences writers today. Students will be expected to connect their close reading of individual texts to broader literary and social context. Readings might include texts such as Harlem Shadows, When Washington Was in Vogue, Quicksand, and The Blacker the Berry, and the course will also examine music, poetry, art, and essay from the period.",
          "department": "English",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL English IV: Writing From the Arab World",
          "description": "The Arab world has a rich literary tradition that pre-dates Islam, and today, Arab writers continue to generate and maintain an equally rich intellectual culture. This course will explore different contemporary authors and different genres that depict a variety of characters, circumstances, and themes, the goal of which is to help broaden our understanding of a culture both modern, shaped by a complex history, and steeped in rich tradition. This cross section of literature in translation takes us beyond both stereotype and misinformation, and beyond our understanding of the Middle East as only a region of chaos, refugees, and terrorism. Possible texts include: Fadia Faqir, Pillars of Salt; Abd al-Rahman Munif, Endings; Mahmoud Darwish, Memory of Forgetfulness; and a compilation of poetry and short stories by Naguib Mahfouz, Yusef Idris, Salwa Bakr, Adunis, and Nizar Qabbani.",
          "department": "English",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL Senior Writing Seminar: Algorithms, AI, and US",
          "description": "Computers and computing have had such an impact on the modern world that it's easy to overlook the breadth of their influence. This course invites students to do the opposite: closely examine the role and impact that computers have on the human world. The course operates from the premise that it is imperative to understand not only how technologies function, but also how they interface with the ways we work, learn, play, and socialize. Our primary mode of exploring these questions will be through an older technology - prose writing. We'll begin by defining what algorithms are and how they feed off data. We'll then turn and examine specific categories of technology and how they impact parts of what it means to be human. Topics might include social media algorithms, fitness and health monitoring, algorithms in finance, and artificial intelligence. We'll also explore the ethical questions surrounding computing such as algorithmic bias, the attention economy, and questions of data privacy. In fitting with the PHI's drive to \"make something and make a difference\", the writing in this course will all engage directly with audiences that have direct stakes in the content of the course. Examples of this might include engaging authors about their work, reaching out to legislators, writing amicus briefs for current court cases, or connecting with local community members or organizations through writing. Familiarity with programming or previous coursework in computer science is not required.",
          "department": "English",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL Senior Writing Seminar: Communicating Science",
          "description": "At the intersection of observation, experiment, and narrative lies the realm of scientific writing. In this course, students grapple with various forms of scientific communication — from the precise language of technical journals to the relatable prose of popular science. They learn to adapt complex topics for various audiences, craft persuasive arguments rooted in evidence, and communicate clearly through data presentation and visualization. This course is not confined to one scientific discipline but will explore a variety of topics which might include public health, particle physics, astrobiology, or cybernetics. At times, students will choose the scientific topics that most intrigue them for their written pieces. For instance, one student might write an abstract distilling a groundbreaking paper in particle physics, while another pens a persuasive article for the public on the need for increased funding to address mosquito-borne disease. This course not only develops key writing tools for students eyeing a future in scientific research but also opens doors for those writers who wish to bring the magic of science to broader audiences.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL Senior Writing Seminar: Guided Humanities Research",
          "description": "This course provides students with opportunities to develop and refine college-level skills for inquiry, research, analytical thinking, and writing as they complete a research project in the humanities. Students will engage in sustained, significant, mentored research that draws on previous academic courses, such as United States History, experiences gained from work in their communities, or through the Norton Family Center for the Common Good and the Alvord Center for Global & Environmental Studies. Possible topics may include: race and democracy in South Africa, sociology and politics of mass incarceration, history of the American college, food deserts in the United States, and gender in contemporary African American fiction. Along with intensive independent research and writing, students will participate in frequent collaborative activities such as peer review, discussion, and group projects.",
          "department": "English",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "CL Senior Writing Seminar: Writing About Art",
          "description": "Engaging with the work of artists and makers, curators, critics, and art historians, this course explores the intersections of writing and art. Visits to the Mercy Gallery, the Loomis Chaffee Archives, and local museums will provide students the opportunity, through criticism, exhibition texts, and essays, to contribute to ongoing cultural dialogue through their own writing. Key topics may include: the shifting roles of art and artists in society; the responsibilities of institutions, curators, and the public in shaping reception; debates about the definition of art and the significance of artistic intent; and the roles that art and objects play as agents of individualism or community building. As they explore writing by critics such as Susan Sontag, John Berger, and Claire Dederer, among others, students will craft their own reflections, analysis, and commentary inspired by art and material culture.",
          "department": "English",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "Independent Studies in English",
          "description": "A student who wishes to undertake an Independent Study Project (ISP) in English must arrange for a project advisor from within the department, submit a written proposal, and obtain approval from the academic advisor, project advisor, department head, and dean of faculty. The ISP must be carried as a second English elective.",
          "department": "English",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "term": "term course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        }
      ]
    },
    {
      "department": "Languages",
      "courses": {
        "Arabic": [
          {
            "title": "Arabic I",
            "description": "This yearlong course introduces the basics of Modern Standard Arabic (MSA), with an introduction to Levantine Colloquial Arabic (from the region including Lebanon, Syria, Jordan, and the Palestinian Territories). Emphasis during the first term will be on mastering the 28-letter alphabet of the Arabic script and pronouncing its sounds, with introductory vocabulary and cultural expressions. The second and third terms will begin to build vocabulary in Levantine and MSA and teach introductory grammar. This course is taught using the Alif Baa and Arabiyyat Al-Naas with accompanying DVDs. Students practice their writing, reading, listening, and speaking skills in both the classroom and independently. This course is not open to native speakers of Arabic.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Arabic II",
            "description": "This yearlong course continues the development of the grammar and vocabulary of Modern Standard Arabic (MSA) and spoken Levantine Colloquial Arabic (from the region including Lebanon, Syria, Jordan, and the Palestinian Territories). The course continues where students left off in Arabic I in Arabiyyat Al-Naas, using specially designed video segments with characters and plot to gain exposure to task-based vocabulary and grammatical structures. Emphasis is placed on reading and writing in MSA, in addition to using Arabic for communication with native speakers. Students practice their writing, reading, listening, and speaking skills in both the classroom and independently. Prerequisite: Arabic I or permission of the department.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              "ARABIC I",
              true
            ]
          },
          {
            "title": "Arabic III",
            "description": "This yearlong course continues the development of the grammar and vocabulary of Modern Standard Arabic (MSA) and spoken Levantine Colloquial Arabic (from the region including Lebanon, Syria, Jordan, and the Palestinian Territories). The course prepares students for advanced Arabic by guiding them through the Al-Kitaab textbook series widely used at the university level. Emphasis is placed on reading and writing in MSA, in addition to using Arabic for communication with native speakers. Students practice their writing, reading, listening, and speaking skills both in the classroom and independently. Prerequisite: Arabic II or permission of the department.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              "ARABIC II",
              true
            ]
          },
          {
            "title": "Arabic IV",
            "description": "This yearlong course continues the development of the grammar and vocabulary of Modern Standard Arabic (MSA) and spoken Levantine Colloquial Arabic (from the region including Lebanon, Syria, Jordan, and the Palestinian Territories). The course continues where students left off in Arabic III in the Al-Kitaab series and uses primary sources in media, history, literature, and film, according to student interest. Emphasis is placed on reading, writing, and speaking in MSA, as the students develop their abilities to engage with more sophisticated topics. Students practice their writing, reading, listening, and speaking skills both in the classroom and independently. Prerequisite: Arabic III or permission of the department.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              "ARABIC III",
              true
            ]
          },
          {
            "title": "Arabic V",
            "description": "This course explores historical and contemporary issues in the Arabic-speaking world through examining primary source material in media, history, literature (e.g., poetry, plays, and short novels), and film. Emphasis is placed on reading, analytical writing, and speaking in MSA, as the students develop their abilities to engage with sophisticated topics in the primary sources. Students practice their writing, reading, listening, and speaking skills both in the classroom and independently. Prerequisite: Arabic IV or permission of the department.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "half course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              "ARABIC IV",
              true
            ]
          }
        ],
        "Chinese": [
          {
            "title": "Chinese I",
            "description": "This course introduces the basic structures of Mandarin Chinese. Emphasis is placed on pronouncing Chinese sounds, developing listening comprehension, learning Chinese characters, and mastering the fundamentals of Chinese grammar, along with an introduction to Chinese culture. This course is taught using the “pinyin” phonetic system and simplified characters. The course is not open to native speakers of Chinese.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Advanced Chinese II",
            "description": "This course continues the development of both written and oral skills in the target language with additional emphasis on acquiring more Chinese characters and improving self-expression on familiar and personal topics. Students will study additional readings and selections of poetry at an accelerated pace that will afford extensive exposure to key cultural topics. Open to students who have performed well in Chinese I or the equivalent. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 2,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "Chinese II",
            "description": "This course further develops mastery of all fundamentals, with emphasis on oral and written skills, along with some attention to social and cultural issues. This class includes frequent written and oral practice aimed at developing self-expression on certain topics and acquiring more Chinese characters.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Advanced Chinese III",
            "description": "Designed for students who have clearly demonstrated strong proficiency in speaking and writing with a mastery of fundamental grammar, this intermediate course further develops the students’ ability to write effectively in the target language and to discuss topics centered on daily life. Students develop a functional, working vocabulary at an accelerated pace. In addition, the study of Chinese history and culture form an increasingly critical role in the curriculum. Open to students who have successfully completed Advanced Chinese II or the equivalent. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 2,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "Chinese III",
            "description": "Students continue to expand their base of vocabulary and sentence patterns, and they focus on developing fluency in the language. There is heavy emphasis on practicing both conversational and written Chinese. The course exposes students to colloquial and common idiomatic expressions and other nuances of spoken Chinese. Students also practice writing letters and essays on reading topics.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Advanced Chinese IV",
            "description": "This advanced course emphasizes composition and discussion in Chinese. The textbook provides the structure and framework for students to understand further the idiosyncrasies and details of Chinese language and culture. Additionally, the course covers a rich variety of topics, including Chinese customs, social phenomena, Chinese proverbs, the role of women, and human rights issues. The study of China’s history as well as contemporary China in the larger global context will play a critical role. Class is conducted exclusively in Chinese. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 2,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "Chinese IV",
            "description": "This course allows students to extend their mastery of the Chinese language. The syllabus includes readings and class discussions on topics relevant to contemporary life in China, Taiwan, and other Chinese communities. Composition writing and oral presentations are also required. Students should expect frequent conversation exercises.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Chinese V",
            "description": "This course allows students to further their study of Chinese language and culture. The syllabus includes readings and class discussions about Chinese history, Chinese language and characters, social changes, and other issues of interest. Class is conducted exclusively in Chinese. Composition/essay writing and oral presentations are also required.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "CL Chinese V",
            "description": "This course is designed in accordance with the College Board guidelines to prepare students for the AP exam in Chinese. Students must develop a deeper appreciation and understanding of the Chinese language and culture. Through intensive reading, writing, speaking, and listening practices, this course aims to elevate students’ level of Chinese proficiency across the three communicative modes (interpersonal, interpretive, and presentational) and the five goal areas (communications, cultures, connections, comparisons, and communities). Students are encouraged to take the AP Chinese exam upon completion of the course. Class is conducted exclusively in Chinese. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 3,
            "gesc": true,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "CL Chinese VI: Contemporary Issues in China",
            "description": "Through selected newspaper articles and essays, this course explores the evolution of Chinese society over the past several decades—a period of time during which we have witnessed a departure from many traditional Chinese ideals. From the astronomical prices of housing and university studies to the “one child” policy, students will tackle difficult topics and gain a better understanding of contemporary issues in the “New China.” Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 3,
            "gesc": true,
            "ppr": false,
            "term": "half course",
            "offered_in_25-26": false,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "CL Chinese VI: Modern China Through Literature",
            "description": "This course explores the work of a few well-known Chinese authors after the Mao era (1976-present). Through readings and discussions of essays, short stories, and novels, students learn the fundamental changes that Chinese people have lived through during the last 40 years and explore how these social, political, and economic changes have affected long-held traditional values, Chinese society, and culture. Prerequisite: completion of CL Chinese V or departmental approval.",
            "department": "Languages",
            "rigor": 3,
            "gesc": true,
            "ppr": false,
            "term": "half course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              "CHINESE V (GESC)",
              true
            ]
          },
          {
            "title": "Independent Studies in Chinese",
            "description": "A student who is highly proficient in a foreign language may propose an Independent Study Project (ISP). The student has to have exhausted all curricular offerings to be considered for an ISP. The student must arrange for a project advisor from within the department, submit a written proposal, and obtain approval from the academic advisor, project advisor, department head, and dean of faculty for any ISP. All discussion and all writing submitted must be in Chinese.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "term course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          }
        ],
        "French": [
          {
            "title": "French I",
            "description": "This course introduces the basic structures of the French language, stressing communication skills: understanding, speaking, reading, and writing. Students practice listening comprehension as well as speaking in the classroom and in the language lab.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Advanced French II",
            "description": "In this class, introductory literary readings accompany extensive oral and aural training as well as exercises focused on form. In the classroom, students speak French almost exclusively, honing their pronunciation and communication skills. Francophone culture and literature are explored through reading selections and films representing a variety of genres and topics. Enrollment is restricted to students who have excelled in French I or whose preparation qualifies them for work at an accelerated pace. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 2,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "French II",
            "description": "This course continues the development of cultural competencies and communication skills, with increasing emphasis on oral proficiency, reading comprehension, and written expression. Students speak in French for the majority of class time.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Advanced French III",
            "description": "This course is an enrichment of French III, offered to students who have performed well in Advanced French II or in an equivalent course at another school. In addition to promoting mastery of grammatical structures and the acquisition of vocabulary, the course presents topics in French and Francophone culture, as well as a variety of reading materials. Students practice their communication skills, written and oral, through a variety of activities. Successful completion of this course may qualify a student to continue in the CL French Language IV course. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 2,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "French III",
            "description": "This course builds on the skills developed in French II, and, through the study of the French language and cultural practices, continues to broaden students’ knowledge and appreciation of the French-speaking world with an increased emphasis on building proficiency. Francophone culture and history are introduced through authentic materials, including short stories, and films. Students write short compositions and begin to express more complex thoughts in speech.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "French IV",
            "description": "This course provides continued development of all linguistic skills: listening, speaking, reading, writing, and cultural competency. It includes review and further study of grammatical structures, and conversational language taught in context. Francophone culture and literature are explored through reading selections and films representing a variety of genres and topics.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "French V",
            "description": "At the fifth level of language study, students may elect term courses, taken either separately or as a three-term sequence. Prerequisite: French IV or permission of the department.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              "FRENCH IV",
              true
            ]
          },
          {
            "title": "French V: Cinema",
            "description": "In this course, students will view and discuss a number of significant and celebrated films that define the major genres of French and Francophone cinema in the twentieth and twenty-first centuries. By analyzing characters, themes, historical references, scenes and cinematic techniques, students will develop a greater appreciation for the cinematic arts and deepen their understanding of French culture.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "spring term",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "French V: Global Challenges in the Francophone World",
            "description": "This course considers a number of current global challenges in the Francophone world related to topics such as identity, politics, France’s colonial history, the environment, health, and nutrition. Students strengthen their command of the language through readings, discussions, and presentations. Readings include selections from French daily newspapers and monthly magazines, while audio and video clips are used from online French-speaking websites.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "fall term",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "French V: Modern Writers",
            "description": "This course explores modern literature through the lens of short fiction. After completing a brief historical overview of French literature, students strengthen their command of the language by discussing and analyzing a number of significant short stories and novellas from the 20th and 21st centuries.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "winter term",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "CL French Language IV",
            "description": "This comprehensive, full-year course is designed to hone linguistic skills, including listening and reading comprehension, interpersonal and presentational speaking, and composition. Students develop their analytical skills and intercultural competency by reading, discussing, and writing about a variety of authentic materials from the French and Francophone world. Throughout the course of the year, CL French IV explores the six global themes designated by the college board, but students sitting for the Advanced Placement examination may want to complete additional review outside of class. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 3,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "CL French V",
            "description": "This full-year course provides an in-depth study of literary, cultural, and social works by classical and contemporary authors. Films from around the Francophone world complement these textual studies. In this stage in their studies, students are able to lead discussions solely in the target language as well as fine-tune their analytical and creative writing skills. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 3,
            "gesc": true,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "CL French VI",
            "description": "This course is offered to students who have successfully completed the Advanced French V course (or its equivalent at another school) or who have returned from the SYA program in Rennes, France. The course concentrates on readings of all genres, from literature to newspaper articles to historical texts. The goal of the course is to acquaint the highly advanced French student with topics from the French-speaking world. The course is taught as a seminar entirely in French, and requires active class participation and debate as well as an ability to make cross-cultural and comparative literature analyses. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 3,
            "gesc": true,
            "ppr": false,
            "term": "half course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "Independent Studies in French",
            "description": "A student who is highly proficient in a foreign language may propose an Independent Study Project (ISP). The student has to have exhausted all curricular offerings to be considered for an ISP. The student must arrange for a project advisor from within the department, submit a written proposal, and obtain approval from the academic advisor, project advisor, department head, and dean of faculty for any ISP. All discussion and all writing submitted must be in French.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "term course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          }
        ],
        "Latin": [
          {
            "title": "Latin I",
            "description": "This course introduces the fundamental vocabulary and grammar required for mastery of classical Latin. By providing both intensive study of basic linguistic elements and practice in reading Latin, this course prepares students for the varied reading program in Latin II. Students focus on mythology as they begin their cultural study of Roman civilization.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Advanced Latin II",
            "description": "This fast-paced course begins with an intensive study of grammar and vocabulary and proceeds with selections from several classical Roman authors. As students work to build Latin vocabulary, they study the Latin roots, prefixes, and suffixes that enrich English vocabulary. Students also continue their cultural and historical study of the Roman world. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 2,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "Latin II",
            "description": "This course begins with a study of grammar and vocabulary and proceeds with selections from several classical Roman authors. As students work to build Latin vocabulary, they study the Latin roots, prefixes, and suffixes that enrich English vocabulary. Students also continue their cultural and historical study of the Roman world.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Advanced Latin III",
            "description": "Like Latin III, this course centers around reading and interpreting texts from the Roman world, with a more intensive focus on grammatical, linguistic, and literary concepts. Through the reading and analysis of texts, students discuss how the Romans’ cultural beliefs and practices influenced the Western world from antiquity to modernity. The goal of this course is to develop and solidify the skills necessary to become lifelong readers of the Latin language.",
            "department": "Languages",
            "rigor": 2,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Latin III",
            "description": "In this course, students focus on reading and interpreting the works of various authors from the Roman world. In addition to nightly readings, students analyze texts and themes in class discussion to understand the culture and context of Roman lives. The fall term includes an intensive grammar review to prepare students for the assigned readings.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Latin Iv/V: Augustan Poets",
            "description": "Students read selections from the works of Horace, Vergil, and Ovid in Latin and in English translation. Special attention is given to the various ways in which these poets reflected upon Augustus’ rise to power and the imperial regime he inaugurated.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "winter term",
            "offered_in_25-26": false,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Latin Iv/V: Catullus",
            "description": "This course examines in detail a major portion of the poetry of Catullus, which traces the development of his unique personality. The importance of the author as a linguistic innovator in Rome is considered.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "spring term",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Latin Iv/V: Cicero",
            "description": "Selections from Cicero’s public orations and private correspondences are read. Pertinent modern political speeches are discussed and compared with Cicero’s speeches. The political situation in Rome during the late Republic is also covered.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "winter term",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Latin Iv/V: Historians at Rome",
            "description": "The nature of the process of writing history from the Romans’ viewpoint, in addition to the actual historical situations themselves, forms the focus of this course. Excerpts from the writings of Nepos, Caesar, Livy, Tacitus, and others are examined and compared.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "fall term",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Latin Iv/V: Roman Comedy",
            "description": "This course examines a play by either Plautus or Terence. In addition to an interpretation of the social aspects of the play, the technical and linguistic workings of a Roman comedy are examined.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "fall term",
            "offered_in_25-26": false,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Latin Iv/V: Roman Satire",
            "description": "Excerpts from Juvenal and the Satyricon of Petronius are presented. Through the reading, the students gain insights into both the personality of these authors and the Roman society that influenced them.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "spring term",
            "offered_in_25-26": false,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "CL Latin",
            "description": "The objective of this course is to hone skills in reading, translating, understanding, analyzing, and interpreting original Latin texts. The syllabus of the course centers on Vergil’s Aeneid and other texts found on the Advanced Placement reading list and includes the study of the cultural, social, and political context of these works. Assignments include analytical essays, comprehensive exams, and oral presentations in class. Students may achieve the mastery necessary to sit for the Advanced Placement examination. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 3,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "Independent Studies in Latin or Ancient Greek",
            "description": "A student who is highly proficient in a foreign language may propose an Independent Study Project (ISP). The student has to have exhausted all curricular offerings to be considered for an ISP. The student must arrange for a project advisor from within the department, submit a written proposal, and obtain approval from the academic advisor, project advisor, department head, and dean of faculty for any ISP.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "term course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          }
        ],
        "Spanish": [
          {
            "title": "Spanish I",
            "description": "This course serves as an introduction to the language and cultures of the Spanish-speaking world. The proficiency-based approach provides students with opportunities to use the target language to express themselves in both speech and writing. Authentic texts and videos in Spanish — in addition to the examination of selected current events — encourage students to make cultural comparisons and use the target cultures as a lens for reflecting on their own beliefs and practices. This course introduces students to the basic structures of the Spanish language and is appropriate for novice Spanish students as well as those who need to strengthen their basic skills.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Advanced Spanish II",
            "description": "This class stresses oral and written proficiency. Additional readings and poetry may be included. Enrollment is restricted to students who have performed well in Spanish I and those whose preparation qualifies them for work at an accelerated pace. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 2,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "Spanish II",
            "description": "This course continues the development of the essential components of Spanish. There is increased emphasis on reading, writing, and oral proficiency.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Advanced Spanish III",
            "description": "Intended for students who have clearly demonstrated proficiency in the language and mastery of the details of grammar and usage of Spanish, this class provides in-depth review and the opportunity to strengthen intercultural competency and hone the skills of speaking, listening, reading, and writing. Students watch short documentary films and engage in open discussions of cultural issues through personal and presentational speaking in the target languages. In addition, students read authentic short stories by acclaimed Spanish-speaking authors and undertake literary analysis through discussion and writing in Spanish. Enrollment is restricted to students who have performed well in Advanced Spanish II and those whose preparation qualifies them for the challenges of this intensive course. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 2,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "Spanish III",
            "description": "This course builds on the skills developed in Spanish II, and, through the study of the Spanish language and cultural practices, continues to broaden students’ knowledge and appreciation of the Spanish-speaking world with an increased emphasis on building proficiency. Students read authentic texts, write compositions, and begin to express more complex thoughts in speech.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Spanish IV",
            "description": "This course is designed for students in their fourth year of study, focusing on refining language proficiency through the three modes of communication outlined by ACTFL: interpersonal, presentational, and interpretive. Students will engage in meaningful conversations, practice producing both spoken and written language for various audiences, and deepen their ability to comprehend authentic materials, such as literature, news, and media. The course synthesizes and builds upon skills acquired in previous years, with an emphasis on real-world communication, cultural exploration, and critical thinking. Students will strengthen their fluency and confidence while exploring a range of topics, from contemporary global issues to the rich cultural history of Spanish-speaking regions.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Spanish V",
            "description": "At the fifth level of language study, students may elect term courses, taken either separately or as a three-term sequence. Prerequisite: Spanish IV or permission of the department.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              "SPANISH IV",
              true
            ]
          },
          {
            "title": "Spanish V: Cinema",
            "description": "In this course, selected films from the Spanish-speaking world are presented. The selections cover a variety of genres, topics, time periods, and styles. Each film is preceded by an introductory work to provide background, and followed by different forms of assessments, including essays, oral presentations, and sketches. Students participate in discussions before, during, and after each movie.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "spring term",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Spanish V: Latin American Civilization",
            "description": "Through readings and discussion, students gain a better understanding of the historical, social, and cultural characteristics of Latin America and are prepared for further literary studies. Students’ fluency increases as they discuss and write in Spanish about the topics covered through an exploration of civilization, culture, current events, and literature of selected Latin American countries.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "fall term",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "Spanish V: Latin American Short Story",
            "description": "This course focuses primarily on short stories of Latin America. By reading representative works, students study the nature of a short story, its development and literary devices, and they gain a better understanding of Latin American culture. Reading, speaking, and writing are carefully integrated with an emphasis on creative expression. Readings are selected from authors including Borges, García Márquez, Allende, and Castellanos.",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "winter term",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              false
            ]
          },
          {
            "title": "CL Spanish Language IV",
            "description": "This comprehensive course stresses oral and written communication skills. Throughout the year, students explore the culture of the Spanish-speaking world in both contemporary and historical contexts, making connections between the happenings in the United States and those around the world. As a discussion-based course, students’ participation is paramount. The curriculum covered by CL Spanish IV utilizes the six global themes designated by the College Board for the Advanced Placement Spanish Language and Culture course, but students sitting for the corresponding examination may want to have additional practice with that type of exercises outside of class. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 3,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "CL Spanish Literature V",
            "description": "This full-year advanced course in Spanish literature provides a comprehensive survey of literary works in a variety of genres, modern and classical, both from Spain and Latin America. Students explore the historical contexts for many of those works and examine the interplay between historical influences and various artistic and literary movements. As students analyze literature in detail, they also participate in discussion, write critical essays, and make original presentations on a variety of topics, all in the target language. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 3,
            "gesc": true,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "CL Spanish VI",
            "description": "This course is offered to students who have successfully completed the CL Spanish Literature V course (or its equivalent at another school), or who have returned from the SYA program in Zaragoza, Spain. The main objective of the course is to engage in scholarly discussions on a wide variety of topics, particularly those from the Spanish-speaking world. For this purpose, we utilize authentic, written and audio-visual materials such as literary works, articles, videos, and films. The course is taught entirely in Spanish, in a seminar style, and requires active class participation and debate as well as an ability to make cross-cultural and comparative literature analyses. Prerequisite: permission of the department.",
            "department": "Languages",
            "rigor": 3,
            "gesc": true,
            "ppr": false,
            "term": "half course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "Independent Studies in Spanish",
            "description": "A student who is highly proficient in a foreign language may propose an Independent Study Project (ISP). The student has to have exhausted all curricular offerings to be considered for an ISP. The student must arrange for a project advisor from within the department, submit a written proposal, and obtain approval from the academic advisor, project advisor, department head, and dean of faculty for any ISP. All discussion and all writing submitted must be in Spanish.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "term course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          }
        ],
        "Other": [
          {
            "title": "Global, Digital Cultures",
            "description": "Will our fascination with social media and technology lead to our downfall or will it save us? Does technology lead us to become more distrustful of one another and more attached to static definitions of identity, or does it foster better connections and more fluid conceptions of identity? To what extent are our very thoughts shaped by decisions made within the programs we interact with on a daily basis? By examining the effects that digital technology and algorithms have had on the practices and products of modern society through a variety of cultural lenses and texts, we will seek to gain a more nuanced understanding of the way the digital age is shaping the way we live, interact, and communicate. Resources guiding our investigation will include excerpts of popular films and shows such as Andrew Stanton’s WALL-E and Charlie Brooker’s Black Mirror; these will be complemented by literary texts (e.g., Richard Powers’ The Overstory) and articles. Prerequisite: open to seniors, juniors, and sophomores by permission of the department",
            "department": "Languages",
            "rigor": 1,
            "gesc": true,
            "ppr": false,
            "term": "term course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "School Year Abroad in France",
            "description": "Please see Alternate Study beginning on page 58.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "School Year Abroad in Spain",
            "description": "Please see Alternate Study beginning on page 58.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "year course",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              null,
              true
            ]
          },
          {
            "title": "Upper-level Latin",
            "description": "After completing the equivalent of Latin III, a student may enroll in a fourth, fifth, and even a sixth level of Latin by selecting any combination of the two cycles of term electives and the CL Latin course.",
            "department": "Languages",
            "rigor": 1,
            "gesc": false,
            "ppr": false,
            "term": "informational",
            "offered_in_25-26": true,
            "required": false,
            "grades": [
              9,
              10,
              11,
              12
            ],
            "prerequisite": [
              "LATIN III",
              true
            ]
          }
        ]
      }
    },
    {
      "department": "History, Philosophy & Religious Studies",
      "courses": [
        {
          "title": "Ancient Philosophy",
          "description": "Facilitating the revolutionary transition from a mythological to a rational worldview, ancient philosophers were the first to ask important questions about the nature of reality and the way in which human beings experience the world. Many of these questions are still being asked today. After surveying the metaphysical and epistemological musings of the pre-Socratic philosophers, students hear Socrates defend himself before an Athenian court against charges of religious heterodoxy and corrupting the minds of the young, watch while Plato constructs an ideal society based on reason, and consider with Aristotle the most rational approach to the good life. While discussing these primary texts, students also address other topics including the nature of reality; the sources and limitations of human knowledge; the nature of the True, the Good, and the Beautiful; social contracts; the nature of government; and piety, justice, and virtue.",
          "rigor": 1,
          "gesc": true,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Civilizations That Changed the World",
          "description": "This course on ancient history is designed for sophomores who are interested in continuing their study of history for one term. This course explores the histories of premodern societies which have most commonly been deemed “classical,” focusing on the multicultural worlds of ancient Mesopotamia, Egypt, Greece, and Rome. Along the way, students will question what it means to be classical and will challenge traditional narratives rooted in limited understandings of Greek and Roman history. Through group discussions, reflective writing, and thesis-building exercises, students will learn to analyze and interpret ancient primary sources, identify themes and issues related to the study of ancient societies, and appreciate cultures removed in time from our own by thousands of years. Students will also learn to understand and evaluate how narratives about the ancient world have been used and misused in the present. The course will culminate in student-led case studies of other classical civilizations from around the world, such as the Mayan, Aztec, Japanese, Chinese, Nubian, or South Asian societies.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            10
          ],
          "prerequisite": [
            "World History",
            false
          ]
        },
        {
          "title": "Comparative Religion",
          "description": "How do we reconcile the competing claims of world religions? Should we dissect them in search of historical origins and political influences? Should we agree to disagree and live in pluralistic ecumenical bliss? Do we reject all as unprovable personal truths? After an introduction to thinking about religion across traditions, this class will address such questions through survey and analysis of beliefs, practices, and artistic principles of two world religions. Pulling on the works of traditional authorities, practicing western academics, monks, and saints, the course foregrounds the metaphysical and experiential foundations of faith. Students will trace how duties, contemplative methods, and art derive from understandings of truth, selfhood, and human purpose. By the close of the term, students should be prepared to approach interfaith dialogue with charitable subtlety, noticing similarity in religious difference, finding difference in apparent similarity, and appreciative of the rigorous sincerity of humanity’s attempts to live true.",
          "rigor": 1,
          "gesc": true,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Genocide: Media, Remembrance, and the International Community",
          "description": "This course seeks to examine genocide from historical, philosophical, and religious contexts, with special significance on the role of the media in shaping the narrative. Students will begin by learning a foundational understanding of the United Nations and the definition of “human rights,” before investigating how genocide has become possible, and even ignored. The course will challenge students to consider the intersection of international law, media, and historical memory in examining selected atrocities, including some lesser-known, from the early twentieth century through the present day. They will explore both primary and secondary sources, such as newspapers, social media, essays, book excerpts, radio transcripts, and films. Ultimately, we hope students will appreciate the complex and nuanced approach to the study of genocide, armed with the tools to ensure that “never again” really means never again.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "United States History or CL United States History",
            false
          ]
        },
        {
          "title": "Germany and the Holocaust",
          "description": "This course investigates the rise of Adolf Hitler and the Nazi state, the implementation of the Holocaust and its aftermath. To understand the roots of antisemitism, the course begins with a look at Europe’s Jewish population over the past five centuries, and continues with a serious examination of the political, social, and economic factors following World War I that made Hitler’s rise to power possible. The course analyzes Nazi racial and political policies, Germany’s involvement in World War II, and the mass annihilation of Jews and others. Students examine the role of bystanders and rescuers, resistance movements, the aftermath at Nuremberg, and the lasting legacies of the Holocaust today.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "World History",
            false
          ]
        },
        {
          "title": "History of Sport in Society",
          "description": "This course will allow students to examine their own perceptions of the role of sport and athletic competition throughout history, as well as in their own lives, through an examination of events from the first Olympic Games of Ancient Greece and the WWI “Silent Night” soccer truce to the Cold War’s “Miracle on Ice” and the rise of basketball in the former Yugoslavia. Athletic competitions have served as a backdrop for larger global issues, and the inspiration for myriad diverse works of literature; thus, poetry, short stories, personal narratives, and longer works will be read and discussed in this course. Students will also investigate these writings in a manner that encourages them to grapple with the significance that athletics have come to play for both the individual and society through the lenses of race and gender. Each student will also conduct an independent research project.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Introduction to Philosophy",
          "description": "At its core, philosophy probes the most fundamental questions about the nature of the world and our place and role within it. The tradition of philosophical thought extends back at least 2,500 years as some of the greatest thinkers have endeavored to make sense and find meaning in our lives. Modern philosophy can be viewed as the systematic attempt to make explicit certain aspects and assumptions that are implicit in our experience, beliefs, values, and rational thought processes as well as the attempt to organize those insights into a comprehensive, internally consistent world view that encompasses the large issues of what there is, how and what we can know, what things have intrinsic value, how ought one lead one’s life, and what are the properties of personhood. This course explores critical philosophical questions in three general areas: theory of knowledge, the philosophy of mind, and ethics. Readings, podcasts, and documentaries from major contemporary philosophers as well as an exposure to some of the most significant philosophers from the past, serve as springboards for discussion. Students should learn to think critically and express themselves clearly in writing and conversation as they reflect on the coherence and consistency of their beliefs and various philosophical positions.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            9,
            10
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Introduction to Religious Studies",
          "description": "Join us on our journey to explore some of the most profound questions that have intrigued humanity for millennia. This course delves into the core inquiries of religious studies: what is the purpose of human existence, what do we know about the origins of the universe, how do we interpret religious texts, and how might we address the mysteries of life and death? A special focus of the class will attend to students’ development of their definitions of a good life; in other words, what does it mean if we live a life full of meaning? The course will examine these questions and additional frameworks through the experiences and beliefs of both explicitly religious and explicitly secular thinkers. Not only will students develop their abilities to think critically and communicate effectively, but also will increase their interdisciplinary thinking, cultural awareness, and reflective skills.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            9,
            10
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Literature of the Bible",
          "description": "Mark Twain once humorously characterized a classic as a book everybody talks about, but nobody reads. Twain would undoubtedly be surprised to learn that the Bible has become such a book. As American society has grown more secular and diverse, biblical literacy among Americans has plummeted. When understanding so much of American history, politics, and culture is predicated upon a familiarity with the literature of the Bible, knowing little or nothing about it can be a real liability. The purpose of this course is to address this deficiency. Students will read generous portions of the literature of the Bible, develop an appreciation for its artistry or poetics, and explore the ways it has been used to enrich the narrative world of American rhetoric, poetry, drama, art, and fiction.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Modern African History: Riot, Rebellion, and Freedom",
          "description": "No single course can cover more than a sliver of the complexity and variety of a continent as diverse as Africa. This course will examine the development of outbreaks of violence in Africa in the movement toward independence and freedom in the post-colonial period (1950s to 1980s). Through learning about some of the economic, social, religious, and political roots of these disturbances, students will in turn garner a better understanding of the continent today. Topics of study may include Hutu extremism and the 1994 genocide in Rwanda, the Suez Canal crisis in Egypt, and apartheid in South Africa. Focusing on these events and others will unravel the complex and challenging, yet vibrant and resilient, history of this continent.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            10
          ],
          "prerequisite": [
            "World History",
            false
          ]
        },
        {
          "title": "Philosophy of Nonviolence",
          "description": "History tells tales of hatred, greed, enmity, and violence between one group of human beings and another. Fortunately, the better angels of our nature prevail on occasion and advocates appear who bear witness to another way of achieving justice and peace in a world of finite resources. What makes it possible for some groups to work together in harmony and what leads other groups to hostility and violence? In various religious and social contexts, how do people seek and mete out justice upon other people, upon other sentient beings, and upon the world around them? This course will explore the development of philosophies and religious beliefs that contend with and justify degrees of violence and nonviolence. Ideas discussed in the course are those of Albert Camus, Dr. Martin Luther King Jr., Peter Singer, Jamaica Kincaid, Mahavira, Rumi, Jesus, and Socrates. A student can expect to discuss these topics and how they intersect with categories such as gender, race, ethnicity, and the environment.",
          "rigor": 1,
          "gesc": true,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Religion, Gender, and Sexuality",
          "description": "This course examines the various ways in which religion, gender, and sexuality intersect across different cultures and historical time periods. Students analyze theologies, texts, and communities of religions using a comparative approach to gain insights into their concepts of gender and sexuality. Topics are covered in a case-study format by comparing two or more sources in these religions: the Abrahamic faiths, Buddhism, Hinduism, and spiritual traditions of Indigenous peoples in the United States. Sample topics include: the Divine; creation myths; authority; society; rites and rituals; regulating bodies; empowerment; LGBTQ+; and popular conceptions of how religious views spill over into culture.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Skeptics and Believers: Faith and Religion in a Secular World",
          "description": "The April 8, 1966, Time magazine cover famously asked, “Is God Dead?” Written by an urban intellectual elite enchanted with science and technology and almost blind to the central role religion was currently playing in the Civil Rights Movement, the article that followed offered a provisional “yes.” The world, it was thought, was on the cusp of a new secular era. The death of God and the end of religion was just a matter of time. It is not often that bright, educated people read the signs of the times so poorly. Today, religion continues to play an important role in every country and in almost every area of human experience, from economics and politics to culture and morality. This course will explore the reasons for its continuing relevance and the various ways it has been, and continues to be, challenged by philosophy and science.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "The Middle East: A History of Peace and Conflict",
          "description": "The Arab-Israeli conflict is one of the longest and most intractable conflicts in the world. Through frequent discussions of Middle Eastern current events, this course will explore the importance of the region to the three monotheistic faiths, the collapse of the Ottoman Empire, and the emergence of Zionist and Arab nationalist movements. Particular attention will be given to the Palestinian-Israeli conflict, the U.S. entanglement in the Middle East since the Cold War, and efforts by the international community to resolve this dispute. Students will gain a better understanding of the dynamics and complexity of conflict in a region characterized by instability.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "World History",
            true
          ]
        },
        {
          "title": "Theory of Knowledge",
          "description": "This course offers a philosophical investigation of the problems of knowledge and mind: What do we know? What can we know? To what extent is our knowledge determined and/or limited by the constitution of our mind or brain? The course confronts early on (as did modern epistemology) the radical skeptic’s challenge that we can never be justified in our claims to know an external world, and then examines possible foundational principles of evidence and reasoning proposed to overcome that challenge. Some of the following topics are considered: the nature of scientific method, the problem of induction, the nature and justification of causal claims, principles of justification assumed in inferences from sense experience to reports about physical objects, philosophical theories of perception, the nature of consciousness, the mind-body problem, and the impact of modern neurological research and the challenge to knowledge posed by the problem of implicit bias. The assignments include readings from historical and contemporary philosophers as well as readings, podcasts, and documentaries focused on the intersection of epistemology, cognitive science, and neuroscience.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Topics in Ethical Theory",
          "description": "Some of the earliest and most important questions to engage philosophers dealt with the moral nature of human behavior. What is the basis of moral judgment? What makes a right action right and wrong action wrong? Is normativity a matter of consequences or a matter of custom, duty, or rights? Is what’s right for me necessarily right for you? Or what’s right for us necessarily right for them? Using a collection of readings from both ancient and modern philosophers, as well as various secondary sources, this course familiarizes students with the terms and implications of this discussion as well as introducing them to a number of normative ethical theories ranging from ethical egoism and ethical absolutism to utilitarianism and Kantian ethics. Additionally, students will reflect on and seek to articulate their own ethical frameworks. Lastly, students will endeavor to understand what light these normative ethical theories can shed on practical considerations and contemporary topics like animal rights, human equality, environmentalism, abortion, euthanasia, and absolute poverty.",
          "rigor": 1,
          "gesc": true,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Topics in Logic",
          "description": "To make explicit our implicit principles of reasoning, this course introduces modern deductive and inductive logic, including propositional and predicate logic and techniques of formal proof. Students examine principles of logic and evidence, the foundations of our systems of knowledge. They come to understand the distinctions between validity and truth; between the actual, the logically possible, and the logically necessary; and between inductive versus deductive logic. Finally, students learn some of the traditional informal fallacies of relevance, ambiguity, and insufficient evidence. The course includes a brief introduction to key issues and readings in the theory of knowledge in order to give the proper philosophical setting and significance to the foundational logical principles.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "United States History",
          "description": "Throughout this course, students will work with essential questions as they seek to create a more equitable narrative of the “American experience” that prioritizes diverse and historically marginalized voices and perspectives. Students approach the study of history by doing the work of historians as they engage with primary and secondary sources, conduct research, and work collaboratively with one another to develop original interpretations in analytical and narrative form. While the course introduces an expanse of content, students also participate in a series of “deeper dives” for a more concentrated focus. By studying historic sources side-by-side with contemporary issues from the 21st century, students better understand how history impacts the present.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": true,
          "grades": [
            11
          ],
          "prerequisite": [
            "World History",
            false
          ]
        },
        {
          "title": "World History",
          "description": "This course seeks to destabilize a Western narrative of world history by encouraging students to analyze and question why and how people construct their worldviews. This course also introduces students to the discipline of history, specifically thinking historically at different chronological and geographic scales. Students will learn to analyze diverse primary and secondary sources, recognize and grapple with multiple perspectives, reflect intentionally, craft arguments, and clearly communicate their thinking. This course satisfies the world history diploma requirement and fulfills a Global & Environmental Studies Certificate course requirement.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "full-year",
          "required": true,
          "grades": [
            9,
            10
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Advanced Seminar: History of the Present",
          "description": "This seminar follows a dynamic approach to exploring the interrelatedness of the past and the present in order to gain a deeper understanding of contemporary global issues. Topics of study may be influenced by ongoing political, economic, and environmental issues, as well as other important social factors such as race, class, and gender. Each issue that the students and instructor choose to investigate will ask students to seek out and apply relevant historical context, to identify and formulate historical arguments, to use other key historical thinking skills, and present their work in a variety of formats. As part of the course, students will be encouraged to research contemporary issues and seek to engage authentic audiences with their findings; in so doing, they will learn to pursue engaged citizenship.",
          "rigor": 2,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            10
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "CL European History",
          "description": "This course analyzes significant cultural, economic, political, and social movements in Europe from 1450 to the present. By presenting the relationship between major themes and trends in European history, students consider the role each played in shaping the development of contemporary institutions, traditions, and conflict. Topics include Reformation and Enlightenment, absolutism and revolution, industrialization and imperialism, war and diplomacy. In addition to providing a basic narrative of events and movements, the goals of CL European History are to develop an ability to analyze historical evidence and historical interpretation, and to express historical understanding in writing. This course is not designed to prepare students for the AP European History exam.",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            10
          ],
          "prerequisite": [
            "World History",
            true
          ]
        },
        {
          "title": "CL History Seminar: Immigration and Ethnicity in the United States",
          "description": "This seminar course provides a detailed examination of both the immigrant experience and the reception of the immigrant in the United States since the nineteenth century. It will consider the causes of immigration, the social, cultural, and economic adaptation of various groups, the development of ethnic group identities, and changing American policy and attitudes toward immigrants and ethnic groups. Areas of studies may include, but are not limited to, the journeys of the following groups: Irish, Italians, Asians, Latinos/as, and Middle Easterners. Class readings and research of micro-history will investigate the personal experiences of these various ethnicities.",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "United States History or CL United States History",
            true
          ]
        },
        {
          "title": "CL History Seminar: Race in American History",
          "description": "CL Race in American History is a college-level course that aims to explore the complex and often difficult topic of race in the United States. Through this course, students will learn about the origins of the concepts of race and racism and how they have influenced the thoughts, actions, identities, and experiences of people living in the United States. The course will examine themes such as institutional racism, whiteness, the model minority myth, as well as the intersectionality of gender and class. Students will have opportunities to chart the changing nature of race in American society and to assess the extent to which progress has been made in dismantling racialized institutions. This course is essential for anyone seeking to understand the role of race in American history and how it continues to impact society today.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "United States History or CL United States History",
            true
          ]
        },
        {
          "title": "CL History Seminar: The American Civil War",
          "description": "The American Civil War was a defining moment in American history. This course examines the causes of the conflict, the war itself, the period of Reconstruction up to 1877, as well as the meanings of the conflict today. Topics discussed in the course include the political developments in both the North and the South, the crisis and trauma of slavery, the participation of Black Americans in the war, the social and cultural history of the conflict, and, of course, military developments of the war. Students will read a mix of primary and secondary source material.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "United States History or CL United States History",
            true
          ]
        },
        {
          "title": "CL History Seminar: Topics in Modern East Asian History",
          "description": "Students enrolled in this course will view the modern progression of East Asian nations and people from 1900 to the present on their own terms. Beyond its focus on the development of students’ active and evidence-driven engagement in dialogue and debate, this course is designed to teach students advanced research and writing methods that build upon those skills introduced in the World History and United States History curricula. Through an analysis of the region’s cultural, religious, social, economic, and political development—and the connections between the diverse people living in the region—this course aims to contest and disrupt stereotypical portrayals of East Asia by providing students with theoretical background, a holistic perspective, and specific case studies.",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "United States History or CL United States History",
            true
          ]
        },
        {
          "title": "CL United States History",
          "description": "The expectations of this course are set at those of a first-year undergraduate skills-based seminar course in American history, with a focus on the craft of history, including sustained analysis of historical sources, frequent writing, and original inquiry and thinking. Students will participate in student-directed discussions, work with a variety of primary and secondary sources, develop independent research skills, and display a high level of engagement in all areas of the course. The course surveys American history chronologically up to the present and raises questions about what fair and equitable narratives of American history can and should entail. This course is not designed to prepare students for the AP United States History exam.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            11
          ],
          "prerequisite": [
            "World History",
            true
          ]
        },
        {
          "title": "Independent Studies in History, Philosophy, and/or Religious Studies",
          "description": "Students who have fulfilled both their history and philosophy, psychology and religious studies diploma requirements may undertake an Independent Study Project. The student must arrange for a project advisor from within the department, submit a written proposal, and obtain approval from the academic advisor, project advisor, department head, and dean of faculty.",
          "rigor": 2,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            "Fulfilled History and PPR diploma requirements; written proposal; approvals (advisor/department/dean)",
            false
          ]
        }
      ]
    },
    {
      "department": "Mathematics",
      "courses": [
        {
          "title": "Geometry- Algebra I",
          "description": "This course is for those students who either have not had a full year of Algebra I or need to strengthen their algebra skills before heading into Algebra II and subsequent curriculum. It covers properties of the real number system, linear and quadratic equations, and prop- erties of exponents and radicals while also introducing students to Euclidian geometry of two and three dimensions. Students develop competence with the graphs of linear, qua- dratic, and exponential equations, and master multiple techniques for solving equations and simplifying algebraic expressions. This course emphasizes the development of algebraic and geometric skills and utilizes Desmos, Delta Math, Problem Attic, and Geogebra. Students who successfully complete this course will have met the diploma requirement for Geometry and be prepared for Algebra II.",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Geometry",
          "description": "This course in Euclidean geometry investigates the definitions, postulates, and theorems of two- and three-dimensional figures and devel- ops students’ proficiency in analyzing and com- municating mathematically ideas effectively. An emphasis is placed on deductive reasoning, proofs, and geometric problem-solving. When appropriate, students utilize technology to enhance the learning process. Algebraic skills are solidified through the application of geo- metrical properties with numerical solutions. Prerequisite: Algebra I",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Algebra I",
            false
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Advanced Geometry",
          "description": "This course covers the same materials as Geometry but at a faster pace, in greater depth, and with greater rigor. In addition, students will complete a more thorough study of trigonom- etry and coordinate geometry. This course is designed for qualified students who have had two full years of algebra and a demonstrated motivation for the study of mathematics. Prerequisite: Algebra II and permission of the department",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Algebra II",
            true
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Algebra II",
          "description": "This course reinforces and further develops the concepts presented in Algebra I and Geome- try - Algebra I, including linear and quadratic equations and inequalities. It then goes on to explore functions involving radical expressions and rational polynomials and finally considers logarithmic and exponential functions and their applications. Beyond traditional algebraic techniques, students learn numerical and graphical solution techniques with the guided use of technology. Additional topics such as trigonometry, complex numbers, and sequences and series may be introduced along the way. Prerequisite: Algebra I or Geometry - Algebra I",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Algebra I or Geometry - Algebra I",
            false
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Advanced Algebra II",
          "description": "This course is designated for students who have excelled in comprehensive first-year algebra course and have demonstrated motivation for the study of mathematics. It covers the same material as Algebra II at a faster pace, in more detail, and with greater emphasis on problem solving and logical reasoning. In addition, stu- dents begin their study of precalculus exploring sequences and series, complex numbers and fractals, transformations and combinations of functions, and unit circle trigonometry. A focus throughout the course is the development of students’ problem-solving skills and conceptual understanding. Placement for new students will be determined by the department. Prerequisite: Algebra I and permission of the department",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Algebra I",
            true
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Precalculus",
          "description": "The Precalculus course continues the study of functions and relations that was begun in Algebra II. This course is intended for students who have completed both Algebra II and Geometry and who aspire to take calculus or one of the statistics offerings in the following year. Students study the properties, graphs, and applications of a variety of different families of functions including linear, quadratic, polyno- mial, exponential, logarithmic, and trigono- metric functions. These functions are explored graphically, algebraically, and numerically. The analysis of the functions is aided by the guided use of technology. While students have expo- sure to all the classic functions of high school math, the course is not intended for those who wish to move into the CL Calculus program. Additionally, the course includes material from discrete math, including sequences, series, combinatorics, and an introduction to probabil- ity and statistics.",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Advanced Precalculus",
          "description": "This course is for students who have a strong background in algebra and geometry and who plan on taking CL Calculus AB or possibly CL Statistics. Students study the properties, graphs, and applications of a variety of families of functions including linear, quadratic, poly - nomial, rational, exponential, logarithmic, and trigonometric. Technology is used as an aid for students to make observations and investigate connections among algebraic, graphical, and numerical representations of functions. In Advanced Precalculus there is less emphasis on the discrete topics of probability and statistics than in the Precalculus course; however, trig- onometric functions and their inverses as well as the notion of limits are covered in greater depth and detail since these topics are critical foundations for the CL Calculus program.",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Advanced Precalculus With Differential Calculus",
          "description": "This course is for students who have a strong background in algebra, plan on taking the CL Calculus BC course, and have demon- strated the motivation to tackle the course’s increased demands. The course moves at an accelerated pace, assumes strong foundational skills and conceptual understanding, and challenges students to think deeply about the content. During the fall and winter terms, students complete the precalculus curriculum, including a review of exponential and loga- rithmic functions and a study of trigonometry, probability, and parametric and polar equations. Then, during the spring term, students have a rigorous introduction to differential calculus-a prerequisite for entry into the CL Calculus BC course. This course emphasizes critical thinking, problem solving, and synthesis of the material. Some students may opt to study CL Statistics in addition to, or instead of, CL Calculus after this course.",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            true
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Calculus",
          "description": "This course introduces students to most of the theories, techniques, and applications of a first-year college calculus course. By mixing theory and application and by using both discrete and continuous examples, the course offers students a solid foundation of the basic techniques of differential and integral calculus and explores the utility of calculus in a variety of fields. Although not covering trigonomet - ric functions, among other topics in the AP program, this course prepares students for a rigorous first-year calculus course in college and enables them to use calculus concepts in other disciplines. Prerequisite: Precalculus",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Precalculus",
            true
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "CL Calculus AB",
          "description": "This course covers the standard material found in a first-year college calculus. In the course, students will develop an understanding of the concepts of calculus, learn the techniques of differential and integral calculus, and apply these understandings and techniques to a variety of applications. The calculus topics are explored algebraically, numerically, verbally, and graphically with the aid of technology. Students wishing to take the College Board AP Calculus AB exam will find that this course covers most of the content on the exam.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "term": "year course",
          "offered_in_25-26": true,
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Advanced Precalculus or Advanced Precalculus with Differential Calculus",
            true
          ]
        },
        {
          "title": "CL Calculus BC",
          "description": "Following the Advanced Placement BC Calculus syllabus, this course begins with a brief review of differential calculus before moving to a rig- orous, college-level introduction to the integral and its connection to the derivative. In the course, students will develop an understanding of the concepts of calculus, learn the tech- niques of differential and integral calculus, and apply these understandings and techniques to a variety of applications. Beyond the topics from CL Calculus AB, students do significant work with sequences and series and explore calculus concepts as they apply to vector functions, parametric equations, and polar functions. The calculus topics are explored algebraically, numerically, verbally, and graphically with the aid of technology. Prerequisite: Advanced Precalculus with Differential Calculus and permission of the department",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Advanced Precalculus with Differential Calculus",
            true
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Topics in Discrete Mathematics",
          "description": "This course explores multiple real-life math- ematical applications and the theory behind them. Topics include voting/election theory, the mathematics of fair division, and the mathematics of apportionment pertaining to government bodies. As time permits, students will also explore further topics including finan- cial literacy, gerrymandering, electoral college system, graph theory, and the mathematics of scheduling. This course is designed for both those who intend to take statistics in the winter and spring terms and those who have an interest in an elective mathematics course strongly based in theory and real-world applications. Prerequisite: Algebra II",
          "gesc": false,
          "term": "fall",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Algebra II",
            false
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Topics in Logic",
          "description": "Please see description under History, Philosophy & Religious Studies offerings. Students interested in logical foundations of mathematics and in greater sophistication in methods of proof may consider this course. Prerequisite: Geometry",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Geometry",
            false
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Statistics I",
          "description": "This course offers a more hands-on approach to the material presented in CL Statistics. The course emphasizes problem-solving, student-generated studies, and group work. Students analyze a significant global issue while completing culminating projects in which they utilize the techniques learned throughout the course. These projects will have components of both written and public presentation. Through- out the course, students utilize a variety of current technologies, including, but not limited to, Desmos, spreadsheet software like MS Excel, and web-based data analysis packages like Gapminder, in order to analyze and present data. Prerequisite: Algebra II Note: Statistics II may only be taken when following Statistics I.",
          "gesc": true,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Algebra II",
            false
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Statistics II",
          "description": "This course offers a more hands-on approach to the material presented in CL Statistics. The course emphasizes problem-solving, student-generated studies, and group work. Students analyze a significant global issue while completing culminating projects in which they utilize the techniques learned throughout the course. These projects will have components of both written and public presentation. Through- out the course, students utilize a variety of current technologies, including, but not limited to, Desmos, spreadsheet software like MS Excel, and web-based data analysis packages like Gapminder, in order to analyze and present data. Prerequisite: Algebra II Note: Statistics II may only be taken when following Statistics I.",
          "gesc": true,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Algebra II Note: Statistics II may only be taken when following Statistics I.",
            false
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "CL Statistics",
          "description": "This course is equivalent to a one-semester, introductory, non-calculus-based college statistics course. The course incorporates four themes: exploring data, learning designs for data collection and experiments, anticipating patterns in advance, and drawing conclusions from data. Computers and the TI-84 calcula- tor are important tools for completing data analysis and understanding more sophisticated statistical concepts. This data-based approach involves group activities and student-generated studies of global topics. The course empha- sizes reading and communicating statistical information accurately in real world situations. Prerequisite: Advanced Precalculus with Dif - ferential Calculus or Advanced Precalculus and permission of the department",
          "gesc": true,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Advanced Precalculus with Differential Calculus or Advanced Precalculus",
            true
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "CL Statistics Accelerated",
          "description": "This course is intended for independent math students who have excelled in a CL Calculus class. The class moves quickly covering the full Advanced Placement Statistics curriculum (see course description for CL Statistics) while meeting half as often as full courses. Unlike CL Statistics, this accelerated course will also include some work with statistics that is calcu- lus based. While the course develops the tools necessary to analyze data and make projections in a variety of real-world situations, students should also come to appreciate the logical principles underlying the inferences. Students will use some of the powerful statistical tools of the TI-84 calculator to organize data and help make appropriate inferences. Prerequisite: A- or higher in BC Calculus or A or higher in AB Calculus and departmental approval",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "A or higher in BC Calculus or A or higher in AB Calculus",
            true
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "CL Multivariable Calculus",
          "description": "For students who have successfully completed CL Calculus BC, this course seeks to solidify calculus content while also providing exposure to the larger realm of advanced mathematics, emphasizing a deep conceptual understanding of abstract material. Students will first learn about various topics that they may encounter when studying mathematics in the future, before focusing in on calculus and where it fits within this larger picture. From there, the course will extend the definitions and concepts of single-variable calculus to higher-dimensional functions. The concepts of limits, continuity, differentiation, and integration are developed rigorously in the context of functions with multiple input and/or output variables. Various applications to physics, computer science, and other areas will be explored. Prerequisite: CL Calculus BC and permission of the department",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "CL Calculus BC",
            true
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "CL Linear Algebra",
          "description": "Linear Algebra is intended for students who have distinguished themselves in their study of mathematics. The course begins by exploring linear systems and matrices, focusing on determinants and other matrix properties. The study of matrices prepares the class for its study of the main objects of linear algebra: vector spaces and linear transformations. By approaching the subject this way, the class serves as an introduction to conceptual mathematical systems that form the basis of abstract algebra. Throughout the course, emphasis is placed on learning the structure of formal mathematical proof writing. Topics that are typically covered in addition to vector spaces and linear transformations are set theory, eigenvectors, and inner product spaces. Prerequisite/Co-requisite: Multivariable Calculus and permission of the department. The course can be taken concurrently with CL Mathematical Modeling with Differential Equations.",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "CL Multivariable Calculus",
            true
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "CL Mathematical Modeling With Differential Equations",
          "description": "This course gives a comprehensive introduc - tion to ordinary differential equations with an emphasis on the applications of differential equations in a variety of fields. Students will develop, simulate, and analyze dynamic mathematical models (models that study how processes change in time) utilizing differential equations and technology to understand the behavior of various biological, ecological, physiological, and medical problems. Topics covered include first order differential equa- tions, phase planes and bifurcation diagrams, higher order differential equations, Laplace transforms, numerical methods, boundary value and initial value problems, qualitative analysis of solutions, and applications of differential equations. Students will leverage Matlab and Simulink software to visualize and solve differ - ential equations. Prerequisite: CL Multivariable Calculus. The course can be taken concurrently with CL Linear Algebra.",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "CL Multivariable Calculus",
            true
          ],
          "ppr": false,
          "duration": "full-year"
        },
        {
          "title": "Independent Studies in Mathematics",
          "description": "A student who has exhausted the offerings of the Mathematics Department or who desires to study a math-related topic not offered as a course may propose an Independent Study Project for credit. The student must arrange for a project advisor from within the department, submit a written proposal, and obtain approv - als from the academic advisor, project advisor, department head, and dean of faculty.",
          "gesc": false,
          "term": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ],
          "ppr": false,
          "duration": "full-year"
        }
      ]
    },
    {
      "department": "Science",
      "courses": [
        {
          "title": "Biology I",
          "description": "This introductory course is organized around four biological themes: change over time, communication, transfer of energy and matter, and homeostasis. Through the lens of these themes, students are able to more deeply understand and appreciate all biological systems. Topics studied include evolution, cell and molecular biology, and human anatomy and physiology. The use of hands-on modeling activities enhances student engagement and understanding. In the lab, students learn how to design well-controlled experiments and how to analyze collected data. Through this lab work, students gain hands-on experience with current techniques used in research laboratories.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            9,
            10
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Advanced Biology I",
          "description": "This course is an introductory biology class for students who have had a full year of chemistry. It covers the same topics as Biology I but emphasizes the biochemical processes in greater depth and detail. As with Biology I, students learn to think critically about how living organisms evolve and survive and are encouraged to make connections to all biological processes within the natural world. The course makes frequent use of case studies to facilitate application of the course content to complex real-world problems. Students spend ample time in the laboratory practicing many of the techniques used in research laboratories today, collecting and analyzing data, and discussing current research topics.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "Chemistry",
            true
          ]
        },
        {
          "title": "Comparative Anatomy",
          "description": "This course investigates the anatomy of several different vertebrate organisms including humans. Systems such as the muscular system, nervous system, digestive system and skeletal system are compared between a variety of organisms. The class includes many hands-on activities with a heavy emphasis on dissection; potential organisms for dissection include fetal pig, snake, rat, mink, and fish as examples. This course focuses on comparing anatomical structure and function and facilitates a greater understanding of evolution and common ancestry among vertebrates. Students interested in this course do not need a deep background in the field of biology but should be interested in animal body systems and function and should not be afraid to take part in dissections.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Biology; Chemistry",
            false
          ]
        },
        {
          "title": "Genetics",
          "description": "This course explores some of the most recent advances in the study of genetics. A review of Mendelian genetics, the structure and function of DNA, and the central dogma of biology enables students to gain deeper understandings of these basic genetic concepts before further investigating the more complex aspects of cancer, evolution, and genetic diseases. Lab work and hands-on activities include exploration of gene expression, genetic engineering, and gene therapy.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Biology; Chemistry",
            false
          ]
        },
        {
          "title": "CL Biology II: Cell Biology I",
          "description": "Cells are the smallest living things that can perform the functions of life and understanding how cells work is fundamental to all biological science. In this course, students study cells from the outside in, beginning with an investigation of membranes and transport followed by explorations of how a cell responds to its environment. Particular emphasis is placed on the study of enzymes, eukaryotic organelles, cellular communication, and cell division and cancer. Students spend time in the lab exploring cell culture and visualizing cells using microscopy.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Biology; Chemistry",
            true
          ]
        },
        {
          "title": "CL Biology II: Cell Biology II",
          "description": "Note: The spring term of Cell Biology may only be taken when following the winter term of Cell Biology.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "CL Biology II: Cell Biology I",
            true
          ]
        },
        {
          "title": "CL Biology II: Genetics",
          "description": "This college-level course studies the profound implications of recent advances in genetics. Topics include the discovery, structure, and function of DNA, Mendelian and non-Mendelian patterns of inheritance as well as the control of gene expression and epigenetics. The course has a significant laboratory component that emphasizes the use of modern techniques such as the isolation of DNA, polymerase chain reaction (PCR), and DNA sequencing. Examples of projects include those focused on genetic engineering and the creation of genetic knockouts as well as DNA sequence analysis aimed at uncovering alterations associated with physical traits.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Biology; Chemistry",
            true
          ]
        },
        {
          "title": "CL Biology II: Microbiology",
          "description": "Microbiology is the study of the tiniest living things, beings so small they cannot be seen with the naked eye. Yet despite their size, these tiny cells have a massive impact on our world, being responsible for recycling nutrients in ecosystems, causing infectious diseases, providing tools for medicine and research, and serving as models for our understanding of all living things. This course will impart to students an understanding of the structure, function, and societal relevance of bacteria, archaea, and viruses. Students spend the majority of the course in the laboratory, conducting a long-term research project aimed at discovering and characterizing viruses yet unknown to science. By the end of this laboratory-intensive class, students will have gained the skills and experience needed to work safely and professionally in a real microbiology laboratory.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Biology; Chemistry",
            true
          ]
        },
        {
          "title": "CL Biology II: Molecular Biology I",
          "description": "Molecular biology is the study of the critical molecules that allow our cells to function. This two-term course explores the vital roles played by proteins and DNA. The winter term of this laboratory-intensive course focuses on the structure, function, and regulation of proteins. In addition to learning the science of proteins, students will conduct a long-term laboratory project aimed at purifying a recombinant human enzyme from an engineered bacterial host. During this process, they will develop strong laboratory skills and gain experience with a variety of techniques commonly used in industrial and research laboratories. Students will conclude the winter term by designing their own genetically engineered microbes.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Biology; Chemistry",
            true
          ]
        },
        {
          "title": "CL Biology II: Molecular Biology II",
          "description": "In the spring term, students will turn their attention to the study of DNA as they build these new genetically engineered microbes, creating organisms with new features and new capabilities. Note: The spring term of Molecular Biology may only be taken when following the winter term of Molecular Biology.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "CL Biology II: Molecular Biology I",
            true
          ]
        },
        {
          "title": "CL Guided Research Projects in Molecular Biology",
          "description": "Guided Research Projects are yearlong, half courses in the science department that allow students who have completed the graduation requirements for science, and those with an interest in the biological and biomedical sciences, to engage in sustained, significant, mentored scientific research. In this capstone class, students conduct authentic research in molecular biology, and with guidance, design their own research question using an established model system for that experimental work (one that matches the expertise of a Loomis Chaffee science faculty member). Projects involve sustained skill acquisition and the development of rigorous scientific methodology; they also require the student to master experimental techniques that go beyond the traditional science department curriculum. Students maintain a research quality notebook and document their results in either extended lab report or scientific poster format, and they present their research findings to an audience at the end of the school year. Acceptance into the Guided Research Project is a competitive process and interested students are required to complete a written application.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            "Fulfillment of or co-enrollment in CL Biology electives; written application",
            true
          ]
        },
        {
          "title": "Chemistry I",
          "description": "Students in this introductory class improve their scientific literacy by developing analytical and problem-solving skills through the lens of basic chemical principles such as atomic theory, chemical reactions and bonding, stoichiometry, gases, solutions, equilibrium, acids and bases, and electrochemistry. Students engage in small-group and individual problem-solving, laboratory investigations, and exercises to hone written and graphical communication.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "Algebra I; co-requisite Algebra II",
            true
          ]
        },
        {
          "title": "Advanced Chemistry I",
          "description": "This course is designed for those students with strong quantitative ability and who also possess an avid interest and proven achievement in science. Through this rigorous and fast-paced course, students come to an understanding of the methods and principles of modern chemical theory. The development of scientific writing and analytical problem-solving skills are emphasized. Topics draw from the basic principles of inorganic chemistry: electronic structure of the atom, periodicity of elements, stoichiometry, chemical bonding, molecular structure, gas laws and kinetic molecular theory, equilibrium, kinetics, acids and bases, oxidation-reduction, and electrochemistry. Throughout the course, students are involved in an extensive laboratory curriculum.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "Advanced Algebra II (co-requisite) or Algebra II (with permission)",
            true
          ]
        },
        {
          "title": "CL Chemistry II",
          "description": "This course continues the study of chemical principles and theory at a level consistent with that of a first-year college offering. It covers all of the topics of the first level course, but at a deeper level and at a faster pace. Inquiry-based laboratory experiments follow the suggestions of the AP curriculum and support the concepts studied in class. Lab work helps students develop proficiency with basic analytical laboratory techniques, and students are frequently asked to design their own protocols to solve problems. This course prepares students for the Advanced Placement examination.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Advanced Chemistry I",
            true
          ]
        },
        {
          "title": "CL Organic Chemistry I",
          "description": "The goal of this course is to give students an introduction to and strong foundation in organic chemistry. Topics covered include chemical structure and bonding, molecular representations, nomenclature, and physical and chemical properties of alkanes, alkenes, alkynes, alkyl halides, alcohols, ketones, and carboxylic acids. This course also introduces students to drawing resonance structures, curved arrows, and reaction mechanisms such as SN1, SN2, E1, and E2. Students will hone their laboratory skills through practical work that involves investigations such as determining the boiling point and melting point of organic substances, extraction of caffeine, simple and fractional distillation, and the classical synthesis of esters.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Chemistry Advanced or CL Chemistry; co-requisite Physics or permission",
            true
          ]
        },
        {
          "title": "CL Organic Chemistry II",
          "description": "This term course is a continuation of the first term of CL Organic Chemistry with an emphasis on instrumental analyses such as infrared (IR) spectroscopy and proton nuclear magnetic resonance (NMR) spectroscopy. More complex organic reactions such as nucleophilic substitution of the carbonyl group, esterification reactions, formation of enols and enolates, multistep synthesis reactions, and retrosynthesis are explored in this second term of organic chemistry. Students conclude the spring term by executing a project in which they come up with a novel way to synthesize an organic molecule of their choice. This class involves significant lab work and use of peer-reviewed scientific journals. Students must take the winter term of Organic Chemistry to be eligible for enrollment in the spring term course.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "CL Organic Chemistry I",
            false
          ]
        },
        {
          "title": "Physics I",
          "description": "This course introduces students to Newtonian physics and a variety of problem-solving techniques. Through laboratory investigation and class discussion, students explore mechanics, energy, waves, optics, electricity, and magnetism. This course emphasizes a practical approach to understanding physics concepts using familiar objects and everyday situations. Physics I is designed to assist students in developing a greater appreciation for real-world problem-solving situations.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "Advanced Precalculus (co-requisite) or Precalculus (with permission)",
            true
          ]
        },
        {
          "title": "Advanced Physics I",
          "description": "Challenging laboratory explorations, engaging classroom derivations and demonstrations, and intimate small group investigations form the core learning experience in Advanced Physics I. Students work together to develop the conceptual understanding, analytical skills, and self-confidence needed to master a wide array of physics topics. The major area of emphasis in the fall term is Newtonian mechanics. In the winter term, students explore electrostatics and circuits. In the spring, the focus shifts to studies of magnetism and geometric optics. The course stresses problem solving with an emphasis on graphical interpretation and incorporating vector mathematics. It is appropriate for students with good aptitude and proven achievement in both science and mathematics.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "One previous science course; co-requisite Advanced Precalculus with Differential Calculus or Advanced Precalculus",
            true
          ]
        },
        {
          "title": "CL Astrophysics",
          "description": "CL Astrophysics provides an in-depth study of the application of physics and mathematics to the field of astronomy. Major topics include celestial mechanics, the internal structure and evolution of stars, the properties and evolution of galaxies, and the large-scale structure and evolution of the universe. In addition, students will collect, process, and interpret astronomical data obtained from a variety of sources, and will make use of the recently renovated O’Brien Planetarium.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "CL Calculus AB or BC; Physics I Advanced or permission",
            true
          ]
        },
        {
          "title": "CL Physics II",
          "description": "This problem-solving intensive course pushes students to consider more deeply the topics introduced in Advanced Physics I and to investigate challenging questions incorporating calculus techniques. Dynamic classroom discussions, extensive small group investigations, and laboratory work centered on experimental design enable students to develop confidence and a strong conceptual mastery. The first half of the course focuses on mechanics — covering Newton’s laws, conservation of energy and momentum, rotational dynamics, simple harmonic motion, and universal gravitation. The second half explores electricity and magnetism — delving deeply into Coulomb’s Law, Gauss’s Law, Ampere’s Law, Faraday’s Law, and circuits involving capacitors and inductors. This course fully prepares students for Advanced Placement examinations in both Mechanics and Electricity & Magnetism.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Advanced Physics I; co-requisite CL Calculus BC or CL Calculus AB (with permission)",
            true
          ]
        },
        {
          "title": "Climate Change",
          "description": "This course explores one of the biggest challenges of the modern world: climate change. Students will examine different types of scientific data to better understand how climate has fluctuated in Earth’s history and how the rate of change has increased exponentially since the industrial revolution. Through current events and case studies, students will explore the science of climate change as well as its impacts on such areas as food security, water security, public health, human population, sea levels, ocean acidification, severe weather events, and biodiversity. Throughout the term, research-based projects and laboratory studies will enable students to apply their learning and understand these concepts more fully.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Ecology",
          "description": "This course focuses on ecological principles and introduces laboratory skills to help students understand the interactions among organisms and between organisms and their environments. Students begin to explore the key ecosystem services provided by natural ecosystems and learn about energy flow, biotic and abiotic factors, and cycling of matter (water, nutrients, etc.) in the ecosystem.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Sustainability: Soil, Water, and Agriculture",
          "description": "This hands-on, project-based course investigates both local and global sustainable agricultural practices with a focus on water use in those practices. The course addresses current water issues, including water pollution, and access to clean drinking water. Students will investigate the specific impact of both traditional and sustainable agriculture on soil health, the hydrologic cycle, and climate change. As a culmination of previous work done in environmental science, students use the Loomis Chaffee campus as a microcosm for learning how to use sustainable practices to improve their local environments.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "CL Environmental Science",
          "description": "This course provides students with the scientific concepts and methodologies to understand the interrelationships within the natural world. Through on-campus field trips and hands-on activities, students will come to a solid understanding of the core ecological principles. In addition, they will learn to identify and analyze environmental problems within the natural world; relative risks will be evaluated and alternative solutions to problems will be examined. Topics covered include ecological foundations and principles, introduction to plant science, energy, climate change, human population and demographics, toxicology, pollution and pandemics, freshwater resources, water quality, and global water issues. Students learn to observe environmental systems critically and to develop and conduct well-designed experiments with the goal of making positive changes to the local Loomis Chaffee campus and surrounding ecosystem and in the spirit of environmental stewardship and sustainability. This course covers the majority, but not the entirety, of the AP Environmental Science curriculum; those students interested in sitting for the AP Environmental Science exam in May will need to complete some independent work to prepare for that exam and should consult with the instructor to identify those additional topics.",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Biology; Chemistry",
            true
          ]
        },
        {
          "title": "CL Guided Research Projects in Environmental Sustainability",
          "description": "This Guided Research Project is an experiential learning approach to environmental stewardship and sustainability using Loomis Chaffee as a location of study and action. Students learn about all the facets of campus sustainability including waste management, energy conservation, water demands, and agriculture. They then put their learning to work as they design and execute their own sustainability project here on campus. Student projects have included renewable energy generation, food waste reduction, residential weatherproofing, the invention of environmentally friendly cleaning products, environmental justice initiatives, and many others.",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            "Biology; Chemistry; pre/co-requisite CL Environmental Science or Ecology",
            true
          ]
        },
        {
          "title": "Astronomy I: Introduction to Astronomy and the Solar System",
          "description": "The fall term course introduces students to observational astronomy and methods for measuring distances in the solar system and universe. Students gain an understanding of the foundations of astronomical evidence for our place in the universe by studying the historical development of astronomy from the ancient Greeks to Kepler and Newton as well as modern techniques for studying planets and stars. The course also provides an overview of our solar system. Students will have the opportunity to view the night sky with the school’s telescopes and make use of the O’Brien Planetarium.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Chemistry or Physics",
            false
          ]
        },
        {
          "title": "Forensic Science",
          "description": "This course focuses on the application of various science techniques used to solve crimes including fingerprinting, blood typing, blood spatter analysis, and DNA profiling. Students combine their knowledge of biology and chemistry in order to solve multiple crime scenes. Students will also learn the basics of the American criminal justice system and discuss its structure, intentions, successes, and shortcomings. The course emphasizes forensic science as a discipline that provides strong, but not infallible, evidence for criminal proceedings. Care is always taken to note the reliability of all techniques studied.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Biology; Chemistry",
            false
          ]
        },
        {
          "title": "Astronomy II: Observing the Universe",
          "description": "This course focuses on stars, galaxies, and cosmology. Major topics include the structure and evolution of stars; stellar explosions and the formation of neutron stars and black holes; the creation of galaxies; relativity and theories about the origin and fate of the universe, with emphasis on the Big Bang; and current questions about the role of dark matter and dark energy. Students will also explore astrobiology, recent space missions, and the possibility of locating habitable planets outside our own solar system.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "two terms",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Chemistry or Physics",
            false
          ]
        },
        {
          "title": "Independent Studies in Science",
          "description": "A student who has completed the two-year laboratory science requirement and who has exhausted the relevant course offerings may propose an Independent Study Project in science. Projects may involve either in-depth research of previously encountered topics or an independent study of material not presently offered. The student must arrange for a project advisor from within the department and submit a written proposal. The proposal will be evaluated by the project advisor, academic advisor, department head, and dean of faculty and may be approved if all criteria are met.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Completion of departmental requirements; written proposal",
            true
          ]
        }
      ]
    },
    {
      "department": "Computer Science",
      "courses": [
        {
          "title": "Computer Science: AI and Digital Literacy",
          "description": "This course builds foundational digital literacy through hands-on exploration of artificial intelligence. Students study computer skills, data security, and the influence of algorithms and AI on society. Focusing on large language models (LLMs), they examine both opportunities and ethical implications of AI, with case studies on privacy, fairness, and society.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Game Design: Where Art Meets Code",
          "description": "This year-long introductory half course combines digital art with programming. Students create 2D video games through digital art design, foundational programming, and integration into playable games. Emphasis is placed on creativity, problem-solving, and technical skill. This course fulfills one visual arts diploma requirement and prepares students to take CL Computer Science.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Global, Digital Cultures",
          "description": "This course examines the effects of digital technology and algorithms on society, identity, and communication through cultural texts and media. Students analyze both dystopian and optimistic portrayals of technology in film, literature, and articles. Resources may include WALL-E, Black Mirror, and Richard Powers’ The Overstory.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            true
          ]
        },
        {
          "title": "Introduction to Computer Science: Programming",
          "description": "This course uses a variety of tools to introduce students to computing principles. Students build skills in programming and algorithm development with topics including calculations, decision-making, data handling, and control structures. This course prepares students to take CL Computer Science.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Introduction to Computer Science: Robotics",
          "description": "This hands-on course introduces concepts and problem-solving techniques in electrical, computer, and mechatronics engineering. Students will study analog circuits, microprocessors, and digital logic through experiments and projects such as music synthesis, mathematical problem-solving, and motor control. Students will also learn formal engineering design processes and become familiar with the Pearse Hub for Innovation. This course prepares students to take CL Computer Science.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Introduction to Problem Solving in Manufacturing, Society, and Entrepreneurship",
          "description": "This course will introduce students to the process of design thinking and provide them with an opportunity to practice the skills involved in three different areas: the design-build process and manufacturing experience in the makerspace; designing and implementing a solution for a problem related to the common good; and tackling a business-related entrepreneurship problem for a local business. This course will meet in the Pearse Hub for Innovation.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            10
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Problem Solving for Engineering",
          "description": "Students will be exposed to concepts and problem-solving techniques taught in typical civil and mechanical engineering curricula. They will also develop computer-aided design skills that will enable them to put these concepts into practice using resources in the Pearse Hub for Innovation. Projects may include structural analysis, gear box design, kinematic mechanisms, and testing engineering materials. Formal engineering design methods will be used to identify and solve problems.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Problem Solving for the Business World",
          "description": "Students will gain experience in the process of design thinking as it applies to businesses, both established and start-ups. Partnering with local businesses, students will solve real-world problems and present their solutions to the partners. This course will meet in the Pearse Hub for Innovation.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Problem Solving for the Common Good",
          "description": "Students will learn about and gain experience in the process of design thinking and how it can be applied to problems related to the common good and social entrepreneurship. They will identify and design solutions for problems/challenges on campus as well as within the local community (Windsor or Hartford area). At least one of the challenges will be global or environmental in nature. This course will meet in the Pearse Hub for Innovation.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "CL Computer Science",
          "description": "A programming-intensive two-term course that follows Introduction to Computer Science. Students primarily learn Python, algorithms, and data structures in the first term, then apply libraries and build larger projects in the second term. This course does not prepare for AP exams. Prerequisite: Introduction to Computer Science, Game Design, or permission of the department.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "two terms",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "Introduction to Computer Science or Game Design",
            true
          ]
        },
        {
          "title": "CL Topics in Computer Science A",
          "description": "A project-oriented term course for students who have completed CL Computer Science or equivalent. Projects are designed with the instructor and may extend concepts from CL Computer Science or explore new areas, often combining software engineering with design thinking. (Not offered in 2025–26.)",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "CL Computer Science",
            true
          ]
        },
        {
          "title": "CL Topics in Computer Science B",
          "description": "Continuation of CL Topics A with different themes. Students design and build applications, encouraged to study computing applications that help others. Prerequisite: CL Computer Science or permission of the department.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "CL Computer Science",
            true
          ]
        },
        {
          "title": "Independent Studies in the PHI",
          "description": "A student may propose an Independent Study Project for credit, arranging a project advisor, proposal, and departmental approvals. Independent studies are approved only for students who have demonstrated commitment and completed appropriate prerequisites.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Written proposal and approvals",
            true
          ]
        }
      ]
    },
    {
      "department": "Performing Arts",
      "courses": [
        {
          "title": "Jazz Band",
          "description": "Open to all wind, percussion, guitar, bass, and keyboard players, the Jazz Band explores both classic and modern jazz. Emphasis is on jazz technique, jazz repertoire, and improvisation. Students who are new to jazz may take this class. A background on your instrument that includes private instruction or previous experience in a school band or jazz band is expected. Participation in major ensemble concerts is a requirement of the class.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Orchestra",
          "description": "The Orchestra is comprised of violins, violas, cellos, and double basses and is designed to expose players to a variety of music. Repertoire is chosen from genres from the Baroque to Contemporary eras and may feature solo student musicians. Wind, brass, and percussion students from the Wind Ensemble may join the strings in larger orchestral works. On occasion, the ensemble collaborates with the Concert Choir and faculty singers. The Orchestra performs in at least two major concerts each year. Seating auditions for strings are held in the fall term. A background on your instrument that includes private instruction or previous orchestra experience is expected. Participation in major ensemble concerts is a requirement of the class.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            "Background on instrument with private instruction or previous orchestra experience expected",
            false
          ]
        },
        {
          "title": "Concert Choir",
          "description": "Open to all who enjoy singing, this course teaches basic techniques of healthy singing through the preparation and performance of a large variety of choral music. Through repertoire ranging from the Renaissance, Baroque, and Classical to American musical theater, pop, and jazz, and especially including a large range of diverse cultural and global vocal pieces, the ensemble works to create a meaningful musical choral ensemble experience while internalizing the characteristics unique to each style. The Concert Choir performs in at least two major concerts each year and may join with the Orchestra or Wind Ensemble in the preparation of larger works. Participation in major ensemble concerts is a requirement of the class.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Acting for the Camera",
          "description": "This course prepares the acting student with techniques and skills for performing on camera. classes will provide opportunities for on-camera acting experience in scripted and improvised scene work, shot framing, and story boarding. performers looking to learn in-depth about meeting the challenges involved in on-camera acting will appreciate and enjoy this course. the course also exposes students to hands-on experience in technical aspects of the behind-the-camera process in capturing the actor’s on-screen performance. this course will help students unlock proven techniques of film making for building their own audition tapes, acting reels, short film, and web-series. students will take turns acting in scenes and working behind the camera. this course may be taken as a sixth course. prerequisite: acting i or permission of the department.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Acting I or",
            true
          ]
        },
        {
          "title": "Acting I: Introduction to Acting",
          "description": "In an effort to enhance confidence in a non-judgmental atmosphere, introduction to acting engages its students with highly improvisational theater games and exercises. over the course of the term or year, students work to discover greater on-stage comfort levels and to decrease stage fright. typical exercises emphasize movement, speech, creativity, originality, and spontaneity, and prepare students for the more traditional acting theory offered in fundamentals of acting. the term course option may be taken as a sixth course.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Acting II: Fundamentals of Acting",
          "description": "This course emphasizes the philosophical basis and techniques necessary for acting in modern comedy and drama. students improve their acting, improvisation, and audition skills by studying naturalistic, objective-based, moment-to-moment acting techniques. the class stresses audition pieces, monologues, and scene study from contemporary plays. viewing of selected film scenes and visits to professional theaters in new york and connecticut complement the course. this course may be taken as a sixth course. prerequisite: introduction to acting or permission of the department",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Introduction to Acting",
            true
          ]
        },
        {
          "title": "Acting: Improvisation",
          "description": "Improvisation class will challenge the acting students to think on their feet while building strong communication and listening skills. performance improvisation requires the actor to work moment-to-moment establishing settings, relationships, situations, and conclusions to both comedic and dramatic story telling. the class will also explore masks to improvise through physical story telling. the class will further challenge the acting student to rid themselves of theatrical self-censorship allowing them to make intelligent, informed, and exciting choices for the stage. this course may be taken as a sixth course. prerequisite: acting i or permission of the department",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Acting I or",
            true
          ]
        },
        {
          "title": "Acting: Shakespeare",
          "description": "This course is designed to make shakespeare accessible to the performer by learning techniques for acting the text while experiencing the delights and challenges of these classic plays, which take place in a multitude of historical times and places. Shakespeare’s works have been globally translated into more than 80 languages and have been performed throughout the world in over 70 nations. his plays (comedies, tragedies, and history plays) tell surprising but recognizable tales of human nature, relationships, conflict, love, war, and the human condition. students will study and perform shakespeare’s plays in a variety of cultural contexts to discover and determine how context affects storytelling in our modern and globalized society. by studying and playing shakespeare’s characters through scene work and individual soliloquies the students will explore the sharing of common stories across cultures. while honing their performance skills the students will develop their communication, critical thinking and problem-solving skills while holding a lens up to current world affairs through shakespeare’s words that offer insight, liberate, inform, and inspire. Prerequisite: acting i or permission of the department.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Acting I",
            true
          ]
        },
        {
          "title": "Acting: Stage Combat",
          "description": "Stage combat is the illusion of violence for stage or screen. this course is an introduction and exploration of technical and aesthetic aspects of stage combat. the goals are for the students to develop the ability to safely portray violence onstage within the context of a play with specificity and dramatic power as well as to understand how stage combat fits into the practice of theater as a whole. understanding the techniques of safe and effective performance combat is a primary objective. the students will build a strong foundation of footwork, attacks, and defenses, and explore movement and partnering techniques specifically for stage combat. other aspects of the class include the development of strength, flexibility, hand/eye coordination, and the understanding and application of principles of safety in working with a partner and in ensemble. this course may be taken as a sixth course. prerequisite: acting i or permission of the department",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Acting I",
            true
          ]
        },
        {
          "title": "Art of Dance",
          "description": "This course introduces students to dance by engaging with the multiple purposes of the art form through hands-on experiences, by learning physical dance technique, & by exploring the history and current state of dance as a form of creative expression and social and cultural practice. students will learn about ballet, modern, and jazz dance through technique classes, readings, discussions, videos, written responses, and collaborative projects. by examining dance in both global and local contexts, we will move toward a fuller appreciation and understanding of the influence of dance in our everyday lives as well as an embodied reflection 53 and expression of the world in which we live. this half-course is open to all students, with no previous dance experience necessary. there is no required performance aspect to this course. for those interested in performing in the fall and spring dance shows, this course should be taken in conjunction with the dance performance ensemble half-course which meets in the same time block on alternating days.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Dance Company",
          "description": "Dance company is the elite dance performance group on campus and is for advanced dancers who wish to dedicate their after-school time and energy to dance, choreography, and performance. students must audition in the fall to be considered for dance company. in addition to maintaining and improving various techniques, this course focuses heavily on learning and making repertory dances that are performed at school activities, in the fall dance showcase, and in the spring dance revue. students will learn choreography and also choreographic theory and methodology. students often collaborate with the instructor and each other in the creation of dances. methods of generating movement and building choreography are also addressed, and students’ choreography is included in some pieces. a visiting guest teacher is brought in during the winter term to give students a broader dance experience. students who wish to dance and perform but who are not cast in dance company or are unable to commit to the full year of after-school rehearsals for dance company are strongly encouraged to sign up for the art of dance and dance performance ensemble daytime classes. note: dance company is cast by audition. auditions are held at the start of the fall term.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Audition required",
            false
          ]
        },
        {
          "title": "Dance Performance Ensemble",
          "description": "This course is for students with intermediate to advanced dance experience. dance performance ensemble students will learn choreography for performance in the fall dance showcase, mlk day, and spring dance revue. students will also work collaboratively with the instructor and each other to research and explore the themes of each piece of choreography. prerequisite: art of dance or permission of the instructor; art of dance may be taken concurrently. students who wish to audition for dance company (after school, fulfills the physical education requirement) are strongly encouraged to first enroll in art of dance and dance performance ensemble (half courses).",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Art of Dance or permission of the instructor",
            false
          ]
        },
        {
          "title": "Hip-hop Dance",
          "description": "This energetic and upbeat class studies various hip-hop and street-dance originated styles that are performed to popular music. the class explores hip-hop and funk dance as a means of expression and art. instruction includes strengthening warm-up, technique exercises, and choreography combinations and emphasizes rhythm, self-expression, and developing personal style through freestyle improvisation and movement exploration. no previous experience is required; the class is open to students of all levels looking to build confidence and coordination through dynamic and fun routines. there is an optional performance opportunity in the spring dance revue for students in this class. hip-hop dance is taught by a visiting guest teacher.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Jazz Dance Technique",
          "description": "In this up-beat dance class, students are introduced to traditional american jazz dance, contemporary jazz, and jazz-fusion styles. participants improve their strength, flexibility, coordination, and musicality through warm-ups, technique exercises, and dance choreography set to popular music of the past and present. there is an optional performance opportunity in the spring dance revue for students in this class.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Making Dance: Choreography",
          "description": "In this course, students will explore and examine the history, theories, and methods of discovering, creating, and crafting dance movement. By learning to manipulate the variables of space, time, energy, rhythm, form, style, and dynamics, students will learn to communicate their thoughts, feelings, and ideas through their own unique, creative, original work. Course work includes the study of the history of dance, the work of a variety of choreographers and their different styles, physical improvisation and movement exploration, solo and/or group choreography, discussion, feedback, journaling, and research. Select students will have the opportunity to preview their works-in-progress in the Fall Dance Showcase and to present finished pieces in the annual Spring Dance Revue. Note: This course welcomes a range of experience levels from novice to advanced dance practitioners as this is a composition rather than a technique class.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Chamber Music",
          "description": "Open to pianists, bowed strings players, classical guitarists, wind and brass players, this course forms duos, trios, quartets, etc. The course provides advanced level instrumentalists with opportunities to study and perform repertoire written specifically for chamber music ensembles. Repertoire is selected from works of major composers and all genres, and groups are formed based on playing ability and level. This class concentrates on the preparation of several scheduled ensemble concerts, in-class performances, and on-campus events. All students electing this course must audition in the fall for appropriate group placement; some students may be advised to further their technical skills another year before admission to the course. This class meets in the same time block as Wind Ensemble and Orchestra and may be taken concurrently with those ensemble classes. Participation in end-of-term class recitals is a requirement of the class.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Chamber Singers",
          "description": "Designed for those students with advanced vocal musicianship and keen interest in choral music, this course challenges the vocalist to work toward a high level of vocal proficiency in a choral setting; particular emphasis is made on sight reading and tone production. Repertoire includes classical and contemporary musical compositions for the smaller ensemble and specializes in multicultural and global music new to the choral genre. The Chamber Singers perform frequently during the school year and are highlighted in at least two major choral concerts in the winter and spring. An audition is required for enrollment. Students electing this course must also elect Concert Choir. Participation in major ensemble concerts is a requirement of the class.",
          "rigor": 2,
          "gesc": true,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Guitar Ensemble",
          "description": "Guitar Ensemble is designed for students who have prior experience on guitar and want to develop ensemble skills. Repertoire includes classical and contemporary works. Students learn to blend tone, maintain rhythmic accuracy, and interpret music collaboratively. Performances are scheduled throughout the year.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Music and Social Action Worldwide",
          "description": "Students enrolled in this course will take a wide look at both the response of musicians to current political events and social movements of the recent past and the varying courses of action musicians have taken to create and galvanize change. In addition, students will consider the question: Do efforts such as music fundraisers and collaborative politically/socially themed concerts actually affect change? Upon analyzing the impact of musicians and their music on disaster relief and political and social oppression, students will discuss the factors needed to determine value and success of such efforts. Class time will be devoted to work in conjunction with the Norton Family Center for Common Good and the Pearse Hub for Innovation to design projects to bring Music and Social Action topics, questions, and queries to the greater Loomis Chaffee community. In addition, students will meet with guest speakers and performers to better understand the role and process of creating or presenting music for social action. (Sample course topics: Lin Manuel Miranda’s work for Puerto Rico, El Sistema, revolutionary folk music in Chile, the music of Sixto Rodriguez, the choral revolution in Estonia, Band Aid, and the musical Hamilton.)",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Music Composition and Theory I: Fundamentals",
          "description": "Have you ever wondered how music works? How do pitch and rhythm make a melody catchy? What makes one chord sound more emotional than another chord? Beginning with the basic elements of music theory — note reading, scales and modes, key and time signatures, intervals and chords, and basic melody writing — this course works to build the musical skills necessary to read, write, and understand melodies, chord progressions and bass lines, seventh chords in inversion, and reading music over four clefs (chorale or quartet style). Students also will begin harmonic analyzation skills. In addition, this course introduces non-western approaches to harmonization and musical organization. The course emphasizes ear training, interval and chord recognition, beginning sight-singing, and melodic dictation. Students will utilize various music theory websites and will explore basic compositional techniques using electronic music notation software. By term’s end, students should possess the skills needed to place out of beginning music theory at the college level. No previous theory, vocal, or keyboard skill is required.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Music History From Rhapsody to Rap",
          "description": "This sojourn through the history of music searches historical roots and development of both classic and popular music. With an emphasis on developing critical and discriminative listening skills, students will seek answers to questions such as: How do rap and New Age music relate to Gregorian chant? How are Smetana and Santana related? How did the song cycle influence the modern-day concept album? From Bach and Beethoven to the Beatles and Beyoncé, students will investigate political and social events that influenced musical forms, the development of musical instruments, and the ever-changing tools of music composition. Through listening sessions, student choice presentations, guest artist performances, discussions, videos, and website research, we will attempt to answer these questions and more.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Music Technology and Composition I",
          "description": "Students enrolled in this course will learn to compose electronic music within Logic Pro, a professional digital audio workstation and music performance software. This project-based course is designed to develop musicianship and exercise an understanding of music characteristics such as rhythm, harmony, form, and timbre. Throughout the course, students will learn to produce electronic music based on the songs they listen to and enjoy. Projects will build a music production skillset that includes audio recording and editing, MIDI control, sample-based production, synthesis, and mixing. Students will learn to listen to and critically evaluate compositions, and they will learn to work in a collaborative, creative environment. Note: This class may not be repeated for credit; a second level of this class is offered.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Music Technology and Composition II",
          "description": "This course focuses on building a portfolio of originally composed and mastered works (at least 2 per term) and learning effective avenues and platforms for online distribution. Each work, regardless of genre or form, will be mixed according to professional standards and will employ some basic mastering techniques. In addition, MT+C2 will expand upon MT+C1 topics and introduce new material including basic mastering techniques, music industry and distribution, advanced features such as signal routing and effect chains, and developing a custom effect plugin. Prerequisite: Music Technology and Composition I or permission of instructor",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            "Music Technology and Composition I or permission of instructor",
            false
          ]
        },
        {
          "title": "Percussion Ensemble",
          "description": "This course is designed for the experienced percussion student who seeks to enhance percussion study and performance with an ensemble experience. Utilizing literature written specifically for percussion ensemble and percussion chamber music, students in this ensemble will play instruments such as marimba, xylophone, timpani, toms, and concert instruments such as bells, gongs, snare, and toms. This ensemble will perform on recital samplers and at campus events throughout the school year. Students enrolled in this class must be able to read and play written rhythms in time and with a steady beat; some students may be advised to further their technical skills before admission to the course. A placement session will take place with the instructor at the start of the school year. Participation in major ensemble concerts is a requirement of the class.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "The History of Broadway Musicals",
          "description": "This course surveys the musical shows, composers, and performing artists of Broadway’s past, present, and future. Students will study the influences of burlesque, vaudeville, Gilbert and Sullivan, and Tin Pan Alley on the 20th and 21st century Broadway musical. Beginning with the development of early show writing teams and composers such as Cole Porter, Jerome Kern, Rodgers and Hammerstein, Rodgers and Hart, and Leonard Bernstein study will continue with Stephen Sondheim, Stephen Schwartz, and the contemporary teams that created shows such as Les Misérables and Miss Saigon, rock musicals such as Tommy and Hair, and the rock musicals of today such as Next to Normal and Waitress. Finally, the class will survey the work of composers such as Jason Robert Brown and Anaïs Mitchell. In addition to viewing and listening sessions and discussions, the class will plan to attend outside and on campus performances, receive visits from local music theater artists, and tour a Connecticut theater. 49 Music Ensemble Performance Courses The following courses provide students with the opportunity to earn arts credit through performance in musical groups. All of these performance courses provide a repertoire of diverse styles and periods. Enrolled students must practice regularly, attend all scheduled rehearsals, and take part in all performances (participation in major ensemble concerts is a requirement of each course). Performance classes are open to students in all classes; ensemble performance and applied music classes may be repeated for credit. For instrumental classes, the student must indicate the instrument to be played in the “Notes” section of the course registration form. Students enrolled in performance classes must attend three Music Department-sponsored concerts of their choice each term to earn concert credits.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Wind Ensemble",
          "description": "Students in the Wind Ensemble (Concert Band) study and perform a stylistically wide variety of inspiring literature composed for the wind ensemble/concert band medium, as well as outstanding transcriptions from other musical sources. Intellectually, artistically, and emotionally challenging, this literature provides the foundation for daily music learning and enjoyment. All students who play woodwind, brass, and percussion instruments are welcome. Students with less than two years playing experience will be asked to audition for placement. This course focuses on each individual students enjoyment of the musical experience and promotes individual and ensemble musical skill development. The Wind Ensemble performs at least two major on-campus concerts each year. Occasional off-campus performances and/or festivals may be part of the experience. Advanced students may be selected to play in symphony works with the Orchestra. Participation in major ensemble concerts is a requirement of the class.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "CL Music Composition and Theory II: Harmony and Harmonic Analysis",
          "description": "This course focuses on the direct application of concepts such as chord progressions, part-writing, figured bass, borrowed chords, modulation, and elements of musical form to both students’ compositions and the analysis of existing musical works. Students will utilize music notation software to create their own works for solo instruments and piano as well as part-writing in four parts. In addition, classes are formatted with harmonic analysis, ear-training, keyboard instruction, sight singing and multiple clef reading. Students will engage in further discussion of non-western approaches to composition and harmonic form. Local and alumni composers are featured as guest instructors and clinicians. Students wishing to take the AP exam should plan on both CL Music Theory II and III. Prerequisite: CL Music Theory I or permission of the department",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "CL Music Theory I",
            true
          ]
        },
        {
          "title": "CL Music Composition and Theory III: Form and Advanced Composition",
          "description": "This course is designed for students with advanced music skills and a strong interest in long-form instrumental and vocal music. Students will apply deep harmonic and form analysis of existing musical works to their own compositions. Topics include borrowed sixth chords, seventh and ninth chords, counterpoint, modulations, and part writing. Students are introduced to classic sonata form and 20th-century and contemporary western and non-western composition and harmony. Significant time is allotted to developing keen ear training and aural recognition skills. At the completion of the course, students may elect to take the AP Music Theory exam. Those students interested in sitting for the AP Music Theory exam in May will need to complete some independent work to prepare for that exam and should consult with the instructor to identify those additional topics. Prerequisite: CL Music Theory II or permission of the department",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [],
          "prerequisite": [
            "CL Music Theory II",
            true
          ]
        }
      ]
    },
    {
      "department": "Social Science",
      "courses": [
        {
          "title": "Behavioral Economics",
          "description": "Traditional economic theory assumes people have rational, well-defined preferences that drive their decision making. However, psychological research has found that in reality, people are often influenced by emotions. Behavioral Economics aims to reconcile economic and psychological theory in order to explore why people behave the way they do in the real world. This course will study the various heuristics (or cognitive shortcuts) humans use in decision making that result in biases. Are people’s buying decisions dictated more by preference or by price? Are people more driven to seek gains or avoid losses? Why do retailers raise prices just to then markdown items to a sale price? Diving into topics such as herding, nudging, price anchoring, and prospect theory, students will begin to understand why people make decisions that are not always in their self-interest. Applying these theories to real world contexts, including possible examples in sports, healthcare, and social media, students will be able to appreciate their practical significance. This course fulfills a psychology, philosophy, and religious studies diploma requirement.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Contemporary Economic Perspectives",
          "description": "This course engages students with current issues as viewed through the economic perspective. By taking a theme-based approach to relevant global topics, students will critically analyze the world around them, seeking to understand the underlying economic problems. The subject matter will purposefully vary from year to year to incorporate contemporary issues; likely topics include social policies and policy making, international trade and development, and business and finance (including the stock market). Regardless of the specific issues, the course will intentionally examine, discuss, and debate multiple perspectives to help students learn and understand the complexities of real-world decision-making.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            10
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Developmental Psychology",
          "description": "This course will investigate the myriad ways that nature, or genetics, and nurture, or experience, interact to shape a person’s development. Students will explore development across the lifespan in the following areas: personality and social relationships; cognition and neuroscience; and gender, sex, and sexuality. The class will introduce the frameworks of foundational theorists in the field and critically examine their applicability today. Students will build arguments around modern-day issues in development using evidence from relevant theorists, case studies, and primary sources. While there is an emphasis on self-reflection and interpreting one’s own experiences through the lens of psychology, students will also consider how differences in genetics, experience, and culture may result in others having different developmental trajectories than their own.",
          "rigor": 1,
          "gesc": true,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Financial Markets",
          "description": "This course examines methods of economic analysis to address and solve real world issues and dilemmas. Investment topics include analysis, diversification, asset allocation, portfolio optimization, the relation between risk and return, trading, and passive (e.g., index-fund) and active strategies. In addition, students will compare investing through the lens of Socially Responsible Investing (SRI) versus Environmental, Socially Responsible, and Governance (ESG) based investments in their portfolios. The course uses case studies that begin locally and then expand to state, national, and international levels. Students conclude the class with a project that focuses directly on a specific American industry of their choice. There are no mathematical prerequisites, and students with a strong interest in current events will excel in the course.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "International Relations",
          "description": "While providing a background on global issues and diplomacy, this course puts students in the seats of public policy leaders and other decision-makers. Students will study many different international issues and perspectives through the lenses of economics, geography, history, and political science. The course encourages students to develop critical thinking, writing, and debating skills by asking nuanced questions about complex global problems, such as war, human rights, trade, healthcare, energy, or food.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "United States History or CL United States History",
            false
          ]
        },
        {
          "title": "Introduction to Economics",
          "description": "All citizens face an essential problem: There are not enough resources to satisfy all our wants and needs. Such scarcity requires difficult choices in the United States and the world, and this course examines the mechanisms for making these choices and their consequences. After an introduction to the basic principles of economic thinking, the course examines real and complex problems in the United States and throughout the world. In looking at the characteristics of the market system, supply and demand, successes and failures of markets, and the role of government in the marketplace, students will learn how to analyze, think critically about, and debate these issues from an economic perspective in order to better understand current economic decisions. Of special interest to those interested in history, politics, and public affairs, this course emphasizes discussion and debate, and welcomes students of all mathematical abilities.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Introduction to Ethics in Psychology",
          "description": "Likely a student’s first formal exposure to both philosophy and psychology, this course will appeal to those looking to hone their argumentation skills, refine their individual moral compass, and learn more about what drives thinking and behavior. After a brief introduction to ethical theories and principles, a case study approach will take students on a tour of famous studies in the history of psychology, including modern-day dilemmas. For example: is it okay to deliberately mislead participants in research to ensure unbiased results? Is it ethical to prescribe placebos? When should someone’s autonomy be restricted for the purpose of mental health treatment? Students will learn frameworks to analyze ethical dilemmas and ultimately argue for the most moral course of action; in addition, they will examine the methodology and findings of each case. This discussion-based class relies on student engagement and encourages productive disagreement. Major topics/themes include deception, informed consent, animal rights, beneficence and non-maleficence, and confidentiality. Students may leave with a better sense of what further coursework they want to pursue within the philosophy, psychology, and religious studies offerings.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            9,
            10
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Jurisprudence: American Legal History",
          "description": "Using historical works, case law, and recent articles, this course introduces the legal system in the United States with a particular focus on constitutional and criminal law. Students explore the background of international systems, the constitutional framework for the judicial branch of the government, and the Bill of Rights to learn how legal systems have evolved from the teachings of Hammurabi to present day cases. Class exercises will include delivering an oral argument and engaging in the process of jury selection for a hypothetical capital murder case. In addition to historical analysis, students will also investigate the ways in which the legal system affects students in schools, especially in terms of the first amendment and freedom of speech.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "United States History or CL United States History",
            false
          ]
        },
        {
          "title": "Macroeconomics",
          "description": "This course takes a deep dive into the U.S. economy as well as the economies of various countries around the world. Students will use the basic economic concepts of scarcity and opportunity cost to explore economic growth and the major macroeconomics problems of inflation and unemployment. In asking questions about the powers and limits of government, students will be introduced to policy to analyze current economic events. This course is taught with the use of real case studies and places emphasis on critical thinking, discussion, and presentation. Real data will be used throughout the term to enhance understanding, and students of all mathematical abilities are welcome. No prior economics background is required.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Neuropsychology",
          "description": "How is it possible that the human brain, a three-pound physical organ in our body, can be responsible for all our behavior and cognition? Neuropsychology focuses on the complex relationship between the brain and the mind. Students will study fascinating cases of brain damage in order to discover the principles of typical brain organization. The course will highlight the structures and functions of the nervous system as they relate to the psychological processes of sensation, perception, attention, memory, learning, and emotion. Other topics to be covered include neural communication and psychoactive drugs as well as clinical conditions such as concussions, CTE, Alzheimer’s, and Parkinson’s disease. In addition to case studies, students will use labs, activities, and clinical assessment tools to gain familiarity with principles of neuropsychology as well as variations in neuropsychological development. By the end of the course, students will be able to dispel common myths about the brain, appreciate the brief but rich history of neuropsychology, and ponder the new directions that technological innovations might take the field.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Positive Psychology",
          "description": "Whereas historically psychology has emphasized human deficit, the emerging field of Positive Psychology is the study of human flourishing. After establishing a framework for what it means to flourish, students will explore the cognitive biases that make it so difficult to accurately predict what will help us achieve that state. An emphasis on research methods will help students understand how psychologists are arriving at a set of empirically-based practices that can improve well-being. Throughout the term, students will implement a selection of these practices into their own lives and reflect on their impact.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Social Psychology",
          "description": "Our social interactions can influence our individual behavior, perceptions, and beliefs in unpredictable ways. This course will examine classic experiments in social psychology that have demonstrated the observable ways that humans think, feel, and behave in social situations. Students will have many opportunities to practice recognizing social psychology concepts at work in their own lives, in current events, and in the media. Additionally, the course aims to give students a more empathetic framework through which to interpret the actions and experiences of others. Major topics will include cognitive biases, conformity, persuasion, and prejudice as well as research design and ethics.",
          "rigor": 1,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "CL Comparative Government and Politics",
          "description": "This course introduces students to comparative politics, the study of political processes and institutions within countries (whereas international relations focuses largely on interactions among and between countries). A comparative study of six nations—the United Kingdom, Russia, China, Iran, Mexico, and Nigeria—serves as the core for this course, with students first considering the historical development of each state, before moving on to an investigation of factors such as elections, political parties, revolutions, and economic and judicial systems. The course aims to illustrate the rich diversity of political life outside the United States, guiding students to an understanding of why countries and regions organize their institutions differently. Recent topics include Brexit and the United Kingdom’s changing relationship with Europe; power and authority in Putin’s Russia; economic growth and industrialization in China; the nuclear program in Iran; NAFTA and Mexico; and Boko Haram vs. democratization in Nigeria. This course will prepare students to take the AP Comparative Government and Politics exam.",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            "United States History or CL United States History",
            true
          ]
        },
        {
          "title": "CL Economics",
          "description": "CL Economics explores micro and macroeconomic topics in greater depth and with significantly greater rigor than the economics term series. In microeconomics, the focus is on understanding individual and business decision-making within the constraints of limited resources and how markets determine prices and the distribution of goods. We will also include the study of labor markets, environmental and justice issues, and the role of the government in the economy. Macroeconomic emphasis will be on unemployment, inflation, gross domestic product, growth, policy decisions, and international economics. Graphical models are stressed throughout the course, and data interpretation is integrated. Therefore, although no previous economics knowledge is required, students must have a strong mathematics background and a commitment to actively engaging in critical thinking and problem solving. Note: this course will mostly prepare students to take both the AP Macroeconomics exam and the AP Microeconomics exam, with some additional preparation required on the part of the student.",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Calculus AB",
            true
          ]
        },
        {
          "title": "CL Social Science Seminar: Globalization",
          "description": "Globalization, the growing interconnectedness of peoples, cultures, and economies, has brought a dramatic increase in both opportunity and competition. While some theorize that globalization is synonymous with Westernization and is inherently tied to processes of colonization, others pose that globalization has been happening for centuries, is multidirectional, and adds to the global fabric. Regardless, it has become the principal system shaping international relations, economic systems, culture, and the environment. Mixing history with current events, students will study and debate fundamental questions of globalization and its consequences.",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "United States History or CL United States History",
            true
          ]
        },
        {
          "title": "CL Social Science Seminar: The U.S. Presidency",
          "description": "What did the Founding Fathers consider when establishing the American presidency? How has democracy been retained and challenged in the last couple of centuries? In what ways have money, the media, and polarization impacted presidential politics? While addressing these questions and others, this multidisciplinary course explores the dynamic state of U.S. presidential elections, the American electorate, and the role of President. After an exploration of democracy, students will use history, political science, and psychology to examine partisanship, polarization, and social identities and their roles in determining presidential voting trends and policies over the last century. Furthermore, students will analyze both the news media and social media and their role in impacting American presidential elections.",
          "rigor": 3,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "United States History or CL United States History",
            true
          ]
        },
        {
          "title": "Independent Studies in Social Science",
          "description": "Students who have fulfilled both their history and philosophy, psychology and religious studies diploma requirements may undertake an Independent Study Project. The student must arrange for a project advisor from within the department, submit a written proposal, and obtain approval from the academic advisor, project advisor, department head, and dean of faculty.",
          "rigor": 2,
          "gesc": false,
          "ppr": true,
          "duration": "term",
          "required": false,
          "grades": [
            12
          ],
          "prerequisite": [
            "Fulfilled History and PPR diploma requirements; written proposal; advisor and administrative approvals",
            false
          ]
        }
      ]
    },
    {
      "department": "Visual Arts",
      "courses": [
        {
          "title": "Drawing I",
          "description": "This course builds basic drawing skills, which form the foundation for later creative work in drawing as well as in all other media. Class work introduces students to observational drawing and to techniques used to represent the three-dimensional world on a two-dimensional surface. Through the study of still life and other imagery, students work in pencil, charcoal, and pen and ink to learn about line, value, and rudimentary issues of composition. The class is designed to benefit all levels of ability, from beginner to individuals with experience.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Painting",
          "description": "Stressing painting from observation, this course provides a foundation in the use of oil paint and brush techniques through subjects such as landscape, still life, portraits and self-portraiture, and painting from photographs. This course is designed for all levels of students but previous work in drawing is helpful.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Digital Photography I",
          "description": "In these courses, students learn the fundamentals of digital photography, starting with proper control, handling, and exposure using a contemporary digital camera. Lessons in capture, resolution consideration, image enhancement/manipulation (utilizing Adobe Photoshop), and ink jet printing techniques are explored. In addition, we discuss the medium’s relationship to cultural, historical, and aesthetic issues within a fine art context. Students will find it beneficial to have their own DSLR or mirrorless digital camera for the course, but it is not required. The department has a limited number of cameras available to check out.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Digital Photography II",
          "description": "This course continues to explore the digital photographic environment, with students learning more complex techniques in Adobe Photoshop. Analogies are made between traditional darkroom practices and digital ones. Students develop a more personal relationship to the medium, which culminates in both a digital and a printed portfolio plus the creation of a printed hardcover photobook.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "Digital Photography I",
            false
          ]
        },
        {
          "title": "Advanced Digital Photo III",
          "description": "This course is for students who completed Digital Photography I and II and have shown the ability to work on a self-directed thematic project over an extended period of time that would culminate in an exhibition in the Barnes and Wilde Galleries. In addition, each student will research historically important photographers and/or photographic genres and give two substantial presentations to the Digital Photography I classes within the term. A final portfolio will round out this term course.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "Digital Photography II",
            true
          ]
        },
        {
          "title": "3D Fabrication and Craft",
          "description": "Students will build three-dimensional objects using both traditional media like woodworking alongside contemporary digital fabrication methods such as 3D printing and CNC machining. Students will use design thinking and critical artmaking approaches to build objects that are valuable for either/both their usefulness and/or their artistic features. The course will emphasize the creative use of materials and fabrication processes.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Game Design: Where Art Meets Code",
          "description": "This year-long introductory half course combines the creativity of digital art with the logic of programming to guide students through the process of designing and building their own 2D video games. In the first trimester, students will explore tools and techniques for creating digital art, learning about design principles, color theory, and digital illustration to develop characters, environments, and other visual elements for their games. During the second trimester, students will learn foundational programming concepts and build confidence in coding, while applying their new skills to create programmatically-generated works of art in a beginner-friendly language. In the final trimester, students will bring together their programming skills and artistic creations to develop a simple, playable 2D game. This course emphasizes creativity, problem-solving, and technical skill, empowering students to bring their ideas to life in an interactive format. No prior experience is necessary. This course fulfills one visual arts diploma requirement and prepares students to take CL Computer Science.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Graphic Design",
          "description": "This course teaches the underlying principles, techniques, craft, and creative practices of using the computer for art and visual communication. Students will produce a range of computer-based creative projects, which may include digital painting and illustration, photographic manipulation and collage, graphic design for logos and posters, and multi-page publications. In addition, this course will introduce students to the histories, theories, and artists of computer-based art and design. This course covers a range of digital art software, including Adobe Photoshop, Illustrator, and Lightroom.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Ceramics I",
          "description": "This course introduces students to foundational hand-building and wheel-throwing techniques in clay. Students will develop a basic understanding of various methods for constructing, surfacing, and glazing their work. As clay is an ancient and globally significant medium, the course will also explore the aesthetics and techniques of ceramicists from diverse time periods and cultures.",
          "rigor": 1,
          "gesc": true,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Ceramics II",
          "description": "This course builds on the skills learned in Ceramics I, emphasizing advanced throwing and hand-building techniques. Students will continue to develop their technical abilities while beginning to explore a personal style in their work. The course will also include further instruction in surface decoration and glazing.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "Ceramics I",
            false
          ]
        },
        {
          "title": "Sculpture",
          "description": "This course introduces students to the fundamental elements of sculpture, including mass, form, space, proportion, and scale. Students will explore three-dimensional forms using both traditional techniques (carving, constructing, assembling) and nontraditional materials (fabric, found objects, sewing, etc.). A variety of projects will focus on spatial relationships and critical issues in sculpture, such as context, cultural themes, performance, the object's relationship to the body, and site-specific considerations.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "2D Studies: Drawing II/Painting II/Printmaking II",
          "description": "This course is designed to give students the opportunity to further their studies in either drawing, painting, or printmaking. Students who have previously taken the level I course in any one of those media will have the opportunity to continue to develop skills that are specific to their chosen technique. Drawing students will maintain a progression that leads to a greater understanding of observational and invented representation through a variety of drawn media. Painting students can continue to develop their oil painting skills and may choose to focus their studies in watercolor painting. Printmaking students will have the opportunity to work with woodblock printing and be introduced to digitally-based relief printing processes. Through their studies, all students will focus primarily on developing personally meaningful visual ideas.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "Level I in chosen medium",
            false
          ]
        },
        {
          "title": "Advanced Studies in Sculpture and Ceramics",
          "description": "This course emphasizes the development of personal artistic vision and excellence in craftsmanship. Students will explore advanced techniques in clay, glazing, and finishing methods in depth. The incorporation of mixed media into their work is encouraged. Various artists will introduce a range of clay techniques, providing additional perspectives and inspiration. Students will be guided to independently develop and refine their own creative ideas.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            10,
            11,
            12
          ],
          "prerequisite": [
            "Ceramics II or Sculpture",
            false
          ]
        },
        {
          "title": "Digital Art Foundations",
          "description": "This course covers the basics of visual communication to help students design more attractive and polished content for use in class (presentations, infographics, animations) and in life (like on social media). In this half course, students will survey digital image making, vector graphics, presentation design, video, and animation, all in service of making projects that address personally expressive topics. Students will also practice their creative thinking skills and learn to innovate from an arts-based perspective. (Not offered 2025–26.)",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Introduction to Glass Art",
          "description": "This course introduces students to fundamental skills and contextual knowledge for working with kiln-formed glass and stained glass in a contemporary visual art and/or design context. Students will learn skills and methods for cutting, fusing, and shaping glass in response to set projects. Transforming glass with heat and cold processes will be the key skills introduced along with strategies to explore and realize creative works. In this course students will competently utilize a range of kiln forming glass working skills and technologies.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "term",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Introduction to Printmaking",
          "description": "This course introduces students to the art of relief printmaking through the in-depth study of black and white as well as color linoleum block printing. Students will design, carve, and print several original prints and be introduced to color mixing and press printing techniques. This course is designed for beginning- to advanced-level students.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "Video and Animation",
          "description": "In this course students learn the fundamentals of time-based visual art, including filmmaking, video art, special effects, and animation. Students will learn how to successfully film and edit video projects, use basic special effects, create motion graphics, and combine animation with real-life footage. Projects may include music videos, expressive experimental cinema, green-screen effects, character animation, and stop-motion.",
          "rigor": 1,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            9,
            10,
            11,
            12
          ],
          "prerequisite": [
            null,
            false
          ]
        },
        {
          "title": "CL Art Seminar",
          "description": "This is a yearlong intensive studio art experience and prepares the serious art student to submit work for two class exhibitions in the Richmond Art Center and, optionally, for the AP examination portfolio. Additionally, students who wish to complete a portfolio for their college application receive instruction and assistance on photographing, editing, and documenting their work. Students follow a self-directed course of study as they complete their work, decide on a preferred medium, and choose a subject matter to explore. Prerequisite: at least two previous courses taken in the visual arts and departmental approval (GESC department approval is required for students who wish to take CL Art Seminar as a GESC minor course elective. Students should let GESC and CL Art faculty know of their intention to pursue this course for GESC diploma credit.)",
          "rigor": 3,
          "gesc": true,
          "ppr": false,
          "duration": "full-year",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "At least two previous visual arts courses",
            true
          ]
        },
        {
          "title": "Independent Studies in Art",
          "description": "Intended for the student who wishes to continue the study of a specific medium beyond the highest level offered, this elective requires a written proposal approved by the academic advisor, project advisor, department head, and dean of faculty. If approved, the student must enroll in the highest level of the appropriate course and serve as a studio lab assistant while working on assignments given by the instructor. The department restricts eligibility to students who have completed their arts requirement through visual arts classes and have taken the highest-level course in the particular medium involved. Painting, watercolor, and printmaking candidates must also have completed Drawing I.",
          "rigor": 2,
          "gesc": false,
          "ppr": false,
          "duration": "half course",
          "required": false,
          "grades": [
            11,
            12
          ],
          "prerequisite": [
            "Written proposal; highest-level course in medium; Drawing I for painting/watercolor/printmaking; completion of arts requirement in visual arts",
            true
          ]
        }
      ]
    }
  ]
}