{
  "department": "Computer Science",
  "courses": [
    {
      "title": "INTRODUCTION TO PROBLEM SOLVING IN MANUFACTURING, SOCIETY, AND ENTREPRENEURSHIP",
      "description": "This course will introduce students to the process of design thinking and provide them with an opportunity to practice the skills involved in three different areas: the design-build process and manufacturing experience in the makerspace; designing and implementing a solution for a problem related to the common good; and tackling a business-related entrepreneurship problem for a local business. This course will meet in the Pearse Hub for Innovation.",
      "rigor": 1,
      "gesc": false,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [10],
      "prerequisite": [null, false]
    },
    {
      "title": "PROBLEM SOLVING FOR THE COMMON GOOD",
      "description": "Students will learn about and gain experience in the process of design thinking and how it can be applied to problems related to the common good and social entrepreneurship. They will identify and design solutions for problems/challenges on campus as well as within the local community (Windsor or Hartford area). At least one of the challenges will be global or environmental in nature. This course will meet in the Pearse Hub for Innovation.",
      "rigor": 1,
      "gesc": true,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [11, 12],
      "prerequisite": [null, false]
    },
    {
      "title": "PROBLEM SOLVING FOR THE BUSINESS WORLD",
      "description": "Students will gain experience in the process of design thinking as it applies to businesses, both established and start-ups. Partnering with local businesses, students will solve real-world problems and present their solutions to the partners. This course will meet in the Pearse Hub for Innovation.",
      "rigor": 1,
      "gesc": false,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [11, 12],
      "prerequisite": [null, false]
    },
    {
      "title": "PROBLEM SOLVING FOR ENGINEERING",
      "description": "Students will be exposed to concepts and problem-solving techniques taught in typical civil and mechanical engineering curricula. They will also develop computer-aided design skills that will enable them to put these concepts into practice using resources in the Pearse Hub for Innovation. Projects may include structural analysis, gear box design, kinematic mechanisms, and testing engineering materials. Formal engineering design methods will be used to identify and solve problems.",
      "rigor": 1,
      "gesc": false,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [11, 12],
      "prerequisite": [null, false]
    },
    {
      "title": "INTRODUCTION TO COMPUTER SCIENCE: ROBOTICS",
      "description": "This hands-on course introduces concepts and problem-solving techniques in electrical, computer, and mechatronics engineering. Students will study analog circuits, microprocessors, and digital logic through experiments and projects such as music synthesis, mathematical problem-solving, and motor control. Students will also learn formal engineering design processes and become familiar with the Pearse Hub for Innovation. This course prepares students to take CL Computer Science.",
      "rigor": 1,
      "gesc": false,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [9, 10, 11, 12],
      "prerequisite": [null, false]
    },
    {
      "title": "INTRODUCTION TO COMPUTER SCIENCE: PROGRAMMING",
      "description": "This course uses a variety of tools to introduce students to computing principles. Students build skills in programming and algorithm development with topics including calculations, decision-making, data handling, and control structures. This course prepares students to take CL Computer Science.",
      "rigor": 1,
      "gesc": false,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [9, 10, 11, 12],
      "prerequisite": [null, false]
    },
    {
      "title": "GAME DESIGN: WHERE ART MEETS CODE",
      "description": "This year-long introductory half course combines digital art with programming. Students create 2D video games through digital art design, foundational programming, and integration into playable games. Emphasis is placed on creativity, problem-solving, and technical skill. This course fulfills one visual arts diploma requirement and prepares students to take CL Computer Science.",
      "rigor": 1,
      "gesc": false,
      "ppr": false,
      "duration": "half course",
      "required": false,
      "grades": [9, 10, 11, 12],
      "prerequisite": [null, false]
    },
    {
      "title": "COMPUTER SCIENCE: AI AND DIGITAL LITERACY",
      "description": "This course builds foundational digital literacy through hands-on exploration of artificial intelligence. Students study computer skills, data security, and the influence of algorithms and AI on society. Focusing on large language models (LLMs), they examine both opportunities and ethical implications of AI, with case studies on privacy, fairness, and society.",
      "rigor": 1,
      "gesc": false,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [9, 10, 11, 12],
      "prerequisite": [null, false]
    },
    {
      "title": "CL COMPUTER SCIENCE",
      "description": "A programming-intensive two-term course that follows Introduction to Computer Science. Students primarily learn Python, algorithms, and data structures in the first term, then apply libraries and build larger projects in the second term. This course does not prepare for AP exams. Prerequisite: Introduction to Computer Science, Game Design, or permission of the department.",
      "rigor": 3,
      "gesc": false,
      "ppr": false,
      "duration": "two terms",
      "required": false,
      "grades": [10, 11, 12],
      "prerequisite": ["Introduction to Computer Science or Game Design", true]
    },
    {
      "title": "CL TOPICS IN COMPUTER SCIENCE A",
      "description": "A project-oriented term course for students who have completed CL Computer Science or equivalent. Projects are designed with the instructor and may extend concepts from CL Computer Science or explore new areas, often combining software engineering with design thinking. (Not offered in 2025–26.)",
      "rigor": 3,
      "gesc": false,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [11, 12],
      "prerequisite": ["CL Computer Science", true]
    },
    {
      "title": "CL TOPICS IN COMPUTER SCIENCE B",
      "description": "Continuation of CL Topics A with different themes. Students design and build applications, encouraged to study computing applications that help others. Prerequisite: CL Computer Science or permission of the department.",
      "rigor": 3,
      "gesc": false,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [11, 12],
      "prerequisite": ["CL Computer Science", true]
    },
    {
      "title": "GLOBAL, DIGITAL CULTURES",
      "description": "This course examines the effects of digital technology and algorithms on society, identity, and communication through cultural texts and media. Students analyze both dystopian and optimistic portrayals of technology in film, literature, and articles. Resources may include WALL-E, Black Mirror, and Richard Powers’ The Overstory.",
      "rigor": 1,
      "gesc": true,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [10, 11, 12],
      "prerequisite": [null, true]
    },
    {
      "title": "CL SENIOR WRITING SEMINAR: ALGORITHMS, AI, AND US",
      "description": "This senior seminar closely examines the role and impact of computers in society. Topics include algorithms, data, social media, AI, ethics, and privacy. Students engage audiences directly through writing projects such as amicus briefs, letters to legislators, and community outreach. No prior programming required.",
      "rigor": 3,
      "gesc": false,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [12],
      "prerequisite": [null, true]
    },
    {
      "title": "INDEPENDENT STUDIES IN THE PHI",
      "description": "A student may propose an Independent Study Project for credit, arranging a project advisor, proposal, and departmental approvals. Independent studies are approved only for students who have demonstrated commitment and completed appropriate prerequisites.",
      "rigor": 2,
      "gesc": false,
      "ppr": false,
      "duration": "term",
      "required": false,
      "grades": [11, 12],
      "prerequisite": ["Written proposal and approvals", true]
    }
  ]
}
